{
  "books": [
    {
      "id": "1",
      "title": "Reproduction",
      "author": "Louisa Hall",
      "myRating": 4,
      "averageRating": 3.79,
      "yearPublished": 2023,
      "dateRead": "2026-01-08",
      "review": "The shit women have to go through!!! GAHHHH"
    },
    {
      "id": "4",
      "title": "Favorite Daughter",
      "author": "Morgan Dick",
      "myRating": 1,
      "averageRating": 3.62,
      "yearPublished": 2025,
      "dateRead": "2025-12-26",
      "review": "Trying to finish this book was one of the hardest things I've ever done. It is horrible. Everything about it. I have no idea why I persevered."
    },
    {
      "id": "5",
      "title": "The Ghostwriter",
      "author": "Julie Clark",
      "myRating": 3,
      "averageRating": 4.06,
      "yearPublished": 2025,
      "dateRead": "2025-12-21",
      "review": "This book was very surface level but I still wanted to know who did it."
    },
    {
      "id": "2",
      "title": "Sleep",
      "author": "Honor Jones",
      "myRating": 5,
      "averageRating": 3.53,
      "yearPublished": 2025,
      "dateRead": "2025-12-16",
      "review": "Took me a long time to get into this. The premise of this book is obviously super disturbing. I was like why is the mom so awful?? I can't go on. But I did go on and I'm glad I did. Very well written and relatable. Reminded me of \"fleishman is in trouble.\" Middle age malaise."
    },
    {
      "id": "6",
      "title": "Here After",
      "author": "Amy Lin",
      "myRating": 5,
      "averageRating": 4.23,
      "yearPublished": 2024,
      "dateRead": "2025-12-12",
      "review": "No notes."
    },
    {
      "id": "7",
      "title": "A Family Matter",
      "author": "Claire Lynch",
      "myRating": 3,
      "averageRating": 3.71,
      "yearPublished": 2025,
      "dateRead": "2025-11-03",
      "review": "A mother's nightmare. This was a sad little book. I wanted much for resolution!!"
    },
    {
      "id": "8",
      "title": "Culpability",
      "author": "Bruce Holsinger",
      "myRating": 1,
      "averageRating": 4.05,
      "yearPublished": 2025,
      "dateRead": "2025-10-31",
      "review": "I hated everything about this book."
    },
    {
      "id": "9",
      "title": "Bitter Sweet",
      "author": "Hattie Williams",
      "myRating": 3,
      "averageRating": 3.91,
      "yearPublished": 2025,
      "dateRead": "2025-10-22",
      "review": "What a horrible man and a horrible story. Made me want to be a doula. A certain type of doula."
    },
    {
      "id": "11",
      "title": "First Time, Long Time",
      "author": "Amy Silverberg",
      "myRating": 5,
      "averageRating": 3.56,
      "yearPublished": 2025,
      "dateRead": "2025-10-20",
      "review": "Devoured it! I love this kind of book."
    },
    {
      "id": "12",
      "title": "Ruins",
      "author": "Amy Taylor",
      "myRating": 4,
      "averageRating": 3.52,
      "yearPublished": 2025,
      "dateRead": "2025-10-16",
      "review": "The ending was unexpected but I had a fun time before then!"
    },
    {
      "id": "13",
      "title": "Ordinary Love",
      "author": "Marie Rutkoski",
      "myRating": 2,
      "averageRating": 4.07,
      "yearPublished": 2025,
      "dateRead": "2025-10-10",
      "review": "I hated this book. It was the most boring book I've ever read."
    },
    {
      "id": "10",
      "title": "Heart the Lover",
      "author": "Lily King",
      "myRating": 4,
      "averageRating": 4.37,
      "yearPublished": 2025,
      "dateRead": "2025-10-07",
      "review": null
    },
    {
      "id": "14",
      "title": "Search History",
      "author": "Amy Taylor",
      "myRating": 4,
      "averageRating": 3.49,
      "yearPublished": 2023,
      "dateRead": "2025-09-29",
      "review": "Very fun!"
    },
    {
      "id": "15",
      "title": "Bring the House Down",
      "author": "Charlotte Runcie",
      "myRating": 5,
      "averageRating": 3.59,
      "yearPublished": 2025,
      "dateRead": "2025-09-26",
      "review": "Unputdownable! I was rapt! More thoughtful review to come. -- \"Bring Down The House,\" is narrated by Sophie, a junior arts critic for a large British newspaper. However, the book is about Alex, the head theater critic. He writes scathing one star reviews and very rarely gives out 5 star reviews. Sophie and Alex are both covering a theater festival in Edinburgh that is 3 weeks long. They are staying together throughout the festival. Early on, Alex attends a one woman show on climate change, that he gives 1 star. As soon as he submits his article for publication the next day, he sees the exact woman from the show at the same bar as him. They end up sleeping together that night. In the morning, she reads his scathing review of her show and is furious. She then changes her show to tell this story with a live audience. Many of Alex's past lovers come out of the woodwork to share how he mistreated them too. Alex gets cancelled. I thought the whole book was engrossing. I felt like I was there with them at the festival. The ending was kind of a mess (the woman from the show almost kills everyone at her final show by accidentally setting the theater on fire and Sophie almost dies) but to me, there were many points that struck me. 1. Sophie is a new mom, like me. She has to leave her only son, Arlo, with her husband, who she has grown distant from since having Arlo. This wasn't a major plot point but it was nice to see someone else struggling in the new motherhood trenches. Her in-laws were incredibly rude and unhelpful to her, an experience I relate to deeply. Sophie's own mother has recently died of cancer and this is a major part of the book. However, as a Goodreads reviewer I respect, Jessica Woodbury, has pointed out. This grief narrative just didn't quite work and felt disjointed from the crux of the book (Alex's cancellation). 2. Is it fair to critique art? I felt inspired and invigorated by Alex. I also love to critique things - specifically books. I related to the sentiment that books are either 1 star or 5 stars, and any score in between is ambivalence on the critic's end. One of my biggest gripes is not being able to find people who have the same reading taste as me. I never know what to read next. Goodreads is how I get most of my recs. I read books, then read the reviews and follow reviewers who I seem to have similar taste to. So I have to scroll through their \"read\" list when the user experience on GR is so abysmal. If I click on a review of one of the books they've read and try to go back to where I was in their \"read\" list, it spits me back to the top of the list, this is very frustrating and tedious. It doesn't help that the \"books you might enjoy since you just read this book\" feature on GR is an absolute train wreck. This got me thinking about how Julia Cameron (author of \"The Artist's Way\") says that critics are blocked artists. Therefore, on some level, Alex must want to be an actor or affiliated with theater production, instead of critiquing it. I think this is true. I love to point out all the flaws of a novel, but I have never written a novel! I desperately want to be a published author but my actions don't align with my words! This also makes me think of what Brene Brown says (I think it's an FDR quote? nope is Teddy Rosevelt) about being in the ring. If you're not in the ring, you don't get to criticize me. Get in the arena yourself, then you can talk. You can't just sit on the sidelines and point out the flaws of others. In other words, it is an incredibly vulnerable act to put your art out into the world. Anyone can be a critic, not everyone can be an artist. 3. I suppose this should be point number 1 but the book centers on #MeToo and ethical boundaries. Alex seems like a real POS but did he do anything ILLEGAL? No. Nonconsensual? No. But what he did was still...ick. And it turns out he's ick to every woman he's ever been with. What a joy! I know many men like this. Ultimately I was most mad at Sophie for being so spineless around him. She ultimately wanted to hook up with him even though she had a first hand account of all of his horribleness. Also, did they even hook up? Sophie ends up telling her husband that they did but they like barely kissed and then stopped. I don't even think this constitutes cheating but I guess that makes me immoral? Ultimately when I enjoy a book, I find it really hard to articulate why! Maybe that means I am a bad writer or maybe that means that art is hard to simply wrap up into a flattened rating. This reminds me of C. Thi Nguyen's work about how we quantify and add metrics to basic human experiences (sleeping, eating, running, etc) and this takes something three dimensional and truncates it into something easily digestible when that's not how human life works. Humans are messy. Art is messy. It can't be summed up in a matter of stars. And everyone has different tastes. One man can't decide what is \"good\" and what is \"bad.\""
    },
    {
      "id": "16",
      "title": "Exalted",
      "author": "Anna Dorn",
      "myRating": 3,
      "averageRating": 3.75,
      "yearPublished": 2022,
      "dateRead": "2025-09-17",
      "review": "I've been in an Anna dorn rabbit hole since I read vagablonde. This was the most superficial of the bunch but it was still quite fun!"
    },
    {
      "id": "17",
      "title": "Discontent",
      "author": "Beatriz Serrano",
      "myRating": 4,
      "averageRating": 3.88,
      "yearPublished": 2025,
      "dateRead": "2025-09-15",
      "review": "Lol the ending was ridiculous. I'm currently about to interview for jobs after a 3 year break and this made me NOT WANT TO AT ALL."
    },
    {
      "id": "18",
      "title": "Bad Lawyer: A Memoir of Law and Disorder",
      "author": "Anna Dorn",
      "myRating": 3,
      "averageRating": 3.44,
      "yearPublished": 2021,
      "dateRead": "2025-09-13",
      "review": "As a fellow cal bear (I went for undergrad) who always thought I'd end up a lawyer, I related to a lot of this. I read the acknowledgments of her first novel and mistook \"thanks mom for always listening to my dumb ideas\" as \"thanks for always supporting me\" but it turns out her mom is kind of b who wants her to be someone else too! Always nice to feel less alone in this way. I partly wished I had gone to law school bc I am such a striver with low self worth and it sounds right up my alley. Alas I went into finance instead and now I am an unemployed aspiring writer lol... she mentions her privilege but I don't really get how people go to law school on someone else's dime and don't feel wracked w guilt. She didn't seem grateful for any of her privilege. I don't know. I found a lot of it boring? I like her novels more."
    },
    {
      "id": "3",
      "title": "Perfume & Pain",
      "author": "Anna Dorn",
      "myRating": 3,
      "averageRating": 3.83,
      "yearPublished": 2024,
      "dateRead": "2025-09-11",
      "review": "Sadly I didn't like this one as much as \"vagablonde\" but I seem to be an outlier. Perhaps bc I read them back to back and they had a lot of similarities? I still am very much into Anna dorn and I think I'll read her memoir on her experience as a lawyer next."
    },
    {
      "id": "19",
      "title": "Vagablonde",
      "author": "Anna Dorn",
      "myRating": 5,
      "averageRating": 3.53,
      "yearPublished": 2020,
      "dateRead": "2025-09-10",
      "review": "Loved it! Sad it's over. I was very stressed for the cats but I perservered. Prue is me and I am Prue (but I am sober). I was annoyed reading in the acknowledgements that the author's mother is actually her #1 fan because I related so much to Prue's cold mom who is never proud of her. Oh well. Maybe one day I'll get over my mommy issues...This was a fun romp and now I will read her other book \"perfume & pain.\""
    },
    {
      "id": "20",
      "title": "Ghosts",
      "author": "Dolly Alderton",
      "myRating": 2,
      "averageRating": 3.87,
      "yearPublished": 2024,
      "dateRead": "2025-08-26",
      "review": "This book was basically a poor rip off of \"nobody tells you this.\" Dragged on and then it just...ended? I do not get the dolly hype. I've tried multiple books of hers! Oh well."
    },
    {
      "id": "21",
      "title": "The Dream Hotel",
      "author": "Laila Lalami",
      "myRating": 3,
      "averageRating": 3.61,
      "yearPublished": 2025,
      "dateRead": "2025-08-21",
      "review": "This was disturbing because it does not feel dystopian enough. Too real. Spoilers to come - she gets freed because Julie is sloppy and signs her real name?? COME ON. and they never show Julie's perspective again? So cheap. So lazy! This was not a page turner but I also wanted to keep going. The \"read with jenna\" sticker is an automatic turn off but I was still intrigued and would not have guessed this would be a pick of a today show host. Anyway this made me really triggered bc I have a young child and the fact that she was separated from her babies over nothing is enough to set me over the edge. I would probably have lost the will to live and taken my own life if I had been Sara. The ending was just way too neat."
    },
    {
      "id": "22",
      "title": "What Kind of Paradise",
      "author": "Janelle Brown",
      "myRating": 2,
      "averageRating": 4.14,
      "yearPublished": 2025,
      "dateRead": "2025-08-15",
      "review": "I do not get the hype. Tedious and boring. Reads like YA."
    },
    {
      "id": "23",
      "title": "The Compound",
      "author": "Aisling Rawle",
      "myRating": 5,
      "averageRating": 3.57,
      "yearPublished": 2025,
      "dateRead": "2025-07-24",
      "review": "Couldn't put it down!! It was like the craziest bad reality show. I ate it up!"
    },
    {
      "id": "24",
      "title": "Audition",
      "author": "Katie Kitamura",
      "myRating": 4,
      "averageRating": 3.32,
      "yearPublished": 2025,
      "dateRead": "2025-07-20",
      "review": "I need a full analysis of what this was!!"
    },
    {
      "id": "25",
      "title": "Sea of Tranquility",
      "author": "Emily St. John Mandel",
      "myRating": 4,
      "averageRating": 4.05,
      "yearPublished": 2022,
      "dateRead": "2025-07-15",
      "review": "Not sure what do make of this. I could definitely tell this was the author of station 11. Why does she do dystopia so well? It's unnerving. I enjoyed it and finished in one sitting (was surprised it was so short) but I'm not really sure what the point was? Maybe I'm an idiot?"
    },
    {
      "id": "26",
      "title": "We Play Ourselves",
      "author": "Jen Silverman",
      "myRating": 3,
      "averageRating": 3.8,
      "yearPublished": 2022,
      "dateRead": "2025-07-09",
      "review": "This was really weird but had brief moments where I wanted to underline things but I was listening to it as an audiobook. The desire for success is deep in me and I am 33 like Cass and feeling like a failure so there was a lot I related to even though a lot of it was rather eccentric. The end was kind of blah."
    },
    {
      "id": "27",
      "title": "The Tell: A Memoir",
      "author": "Amy Griffin",
      "myRating": 3,
      "averageRating": 3.97,
      "yearPublished": 2025,
      "dateRead": "2025-06-17",
      "review": "okay so this book took me on a wild ride. at first, i was fully invested. i cared deeply about her story and wanted to find out the \"secret.\" once it was revealed, i totally believed her (and I still do). I am having my own \"being failed by the justice system/loophole riddled experience.\" so her quest for justice, i felt it deeply. one of my (many) toxic traits is that when i'm reading/watching something, i am so impatient that i must look up the subject even before i've finished the book/movie. so i look amy up. she's very thin, blonde and pretty. this in itself is not a crime, obviously. but then i realize the john she's married to is a billionaire hedge fund dude. all the photos of her on the internet are with oprah, gwenyth paltrow, reese witherspoon, etc. and a bunch of photos of her and her husband at the met gala - why?? this book is an oprah's book club selection but i had never heard of it until i read lena dunham's substack and a guest writer said she was reading it. then after the google images i saw what an intense pr machine was backing this book. then the parts that didn't work for me bubble to the surface. when she said she wants to go back to work once her kids are in school after being a full time stay at home mom (who doesn't cook) and she just decides i'll be a venture capitalist and fund women owned companies! one does not simply go from stay at home mom to VC overnight...you have to have a billionaire husband....that felt like an important disclosure to me?? this is key context into why she was able to wallow for months/years and everything in her life kept going without a hitch. i googled john griffin and the first article i found was about how he flew his private jet to new zealand before corona was announced as an emergency situation. yuck. so i started reading the goodreads reviews before i finished the book (i hate when I do this!) and i soured on her completely. people pointed out how self absorbed she was and i couldn't unsee this. i think her points about wanting to be \"perfect\" ring true for many eldest daughters (myself included). i always want to make myself small (physically and emotionally) and to not take up space. i look back on so many moments of my life with boys/men in intimate settings and wish i had just said NO! but i didn't feel like i had any agency at the time. i was so used to overriding my bodily instincts to please others. so i appreciated her telling her story in that regard. but i do agree that i wish there was more internal reflection. she constantly says shes \"done the work\" but i still don't think she knows what this means. this is different for everyone but i think she is still in the early innings. aka when you shouldn't be writing a memoir and having oprah tout its glory. others pointed out that amy was shocked that so many women have experienced sexual abuse. like WHAT. how could she be so naive/ignorant?? i don't believe it for a second. it just seems like her life was pleasantville in b&w and now she's seeing the slightest bit of color. she seems like she was a sad person before. i am happy she has gone to therapy but i think there's still so much for her to learn before she uses her platform this way. it is interesting the way i criticize her more deeply for being a wealthy, pretty, white woman. i just expect her to do more with her privelige. like others on goodreads, i wish she had used her power for better. this just all feels pretty self indulgent. which i guess tracks because she never admitting a single thing in her book that made her look bad. it was effusive in its self praise - i am the nicest, and the best. except i didn't win homecoming queen once. that sucked. lol. i relate to her wanting to tie up the story in a bow and recognizing that life just doesn't turn out that way. i also relate to feeling like you need to prove yourself to your parents. i related so much to that. i am constantly trying to untangle myself from the mess that is me trying to please my parents. but i know these wounds/beliefs run deep. tldr - mixed feelings on this book. everyone is inherently an unreliable narrator. not that i don't believe this happened to her. i do. it's just the way she paints herself as this saint that didn't sit right with me. everyone is multi-faceted. i have a hard time believing she was so...bland. i guess the patriarchy runs deep and if you marry a billionaire all you focus on is being \"perfect.\" im sure reese will make this into a hulu show soon but i think there are so many other books that would be better. read \"what my bones know\" or \"know my name\" if you want to read about women truly confronting their trauma with more authenticity."
    },
    {
      "id": "28",
      "title": "The God of the Woods",
      "author": "Liz Moore",
      "myRating": 4,
      "averageRating": 4.11,
      "yearPublished": 2024,
      "dateRead": "2025-05-18",
      "review": "I did not like the ending but I didn't see it coming so that's something. I was gripped. I do not care for books that switch between years and narrators but this was not as annoying as it usually is."
    },
    {
      "id": "29",
      "title": "Careless People: A Cautionary Tale of Power, Greed, and Lost Idealism",
      "author": "Sarah Wynn-Williams",
      "myRating": 5,
      "averageRating": 4.15,
      "yearPublished": 2025,
      "dateRead": "2025-05-12",
      "review": "Am I an idiot? I ATE \"Lean In\" up when I graduated college in 2014. I think I received 4 different copies of that book for graduation. I was going to lean in so hard!! The goal was to be like sheryl! Years later, I crashed and burned and realized I am not sheryl. I don't think it's fair to blame my 22 year old self for not being more of a critical thinker but damn, it seems so clear now that sheryl's suggestions are insanely toxic and ignore systemic issues. maybe I'm just naive and easy to convince (just like my 22 year old self) but I LOVED this memoir. I was GRIPPED the entire time. I love toxic corporate tell alls and this one was so well written. she is clearly such a badass (the shark attack in the beginning SHOOK me). I kept thinking \"damn, did she not have to sign an nda??\" but AI tells me that she did: \"Multiple sources confirm that Wynn-Williams signed a non-disparagement agreement as part of her severance package upon her departure from Meta. This agreement falls under the broader category of NDAs (non-disclosure agreements) and specifically prohibits making \"disparaging, critical, or otherwise harmful\" remarks about the company. Meta initiated arbitration proceedings against Wynn-Williams immediately after the release of her book, arguing that her memoir violated this agreement. The arbitrator issued an emergency order barring her from promoting or discussing her book and from making any critical statements about Meta. Reports indicate that Wynn-Williams was required to sign this agreement in order to receive financial compensation upon leaving the company.\" Interesting...so she's allowed to publish but not promote...weird but I'm here for it. She does not disappoint with the tea! What a shit show at the fuck factory. I deleted my FB account in 2018 after the Cambridge analytica scandal but reactivated it in 2021 to use marketplace. I hate that I still have a FB account. at least I deleted insta in 2021. I try to limit my interactions with the algorithm but even substack is feeling fraught these days. I'm sure she's not the saint that she paints herself as...and the whole \"I can do more change on the inside\" schtick is (to me) clearly a coverup to feel better about working at a bad place (and knowing you are by association, bad too but you want that $$$). I am going through my own whistleblowing disaster so this book was very timely for me. what a sad world we live in...ugh I will write more on that eventually... My only gripe is the title \"careless people\" sounds to much like \"careless whisper.\" another reviewer said \"swimming with sharks\" was right there and yes, it would have been so much better if that were the title! 100% recommend you read this ASAP! I need to know what she's up to now!"
    },
    {
      "id": "30",
      "title": "Crush",
      "author": "Ada Calhoun",
      "myRating": 3,
      "averageRating": 2.94,
      "yearPublished": 2025,
      "dateRead": "2025-05-06",
      "review": "This was a hate read. Reminded me of Leslie Jamison's \"splinters\" - the writing is good but the content is such a drag. The writers are so self obsessed. The reader never gets rewarded for reading. There's no growth. I don't know why I muscled through it. I'm pretty bored. Help I don't know how to pick books to read!!"
    },
    {
      "id": "31",
      "title": "The Wedding People",
      "author": "Alison Espach",
      "myRating": 4,
      "averageRating": 4.08,
      "yearPublished": 2024,
      "dateRead": "2025-05-03",
      "review": "This was shallow but fun"
    },
    {
      "id": "32",
      "title": "Rules of Civility",
      "author": "Amor Towles",
      "myRating": 4,
      "averageRating": 4.09,
      "yearPublished": 2011,
      "dateRead": "2024-12-31",
      "review": "What a delight! Got a little bored in the middle but it was worth finishing! I especially enjoyed the epilogue."
    },
    {
      "id": "33",
      "title": "Rental House",
      "author": "Weike Wang",
      "myRating": 3,
      "averageRating": 3.28,
      "yearPublished": 2024,
      "dateRead": "2024-12-17",
      "review": "This was not fun at all to read. The author frequently writes about interracial marriage, which she does well, but this one was a slog."
    },
    {
      "id": "34",
      "title": "Intermezzo",
      "author": "Sally Rooney",
      "myRating": 1,
      "averageRating": 3.81,
      "yearPublished": 2024,
      "dateRead": "2024-11-21",
      "review": "I feel like I'm taking crazy pills!! How could this have such a high average rating??? As someone else said \"Perhaps she's so popular because she's managed to make soft-porn romance intellectually respectable.\" This book was absolute trash. I loved conversations with friends, watched the tv series of normal people and loved it, felt meh when I read the book (it was just like the show which I guess is good?), and was not impressed with beautiful world. But this...this was HORRIBLE. Dragged on and on. So boring. Can't even believe I powered through. Rooney loves damaged/flat/victim women (usually so physically brutalized that they are disabled somehow) - what is that about?"
    },
    {
      "id": "35",
      "title": "All Fours",
      "author": "Miranda July",
      "myRating": 4,
      "averageRating": 3.41,
      "yearPublished": 2024,
      "dateRead": "2024-09-04",
      "review": "Lots of gratuitous sex but otherwise intriguing."
    },
    {
      "id": "36",
      "title": "Long Island Compromise",
      "author": "Taffy Brodesser-Akner",
      "myRating": 2,
      "averageRating": 3.75,
      "yearPublished": 2024,
      "dateRead": "2024-08-11",
      "review": "I loved her first book but HATED this one."
    },
    {
      "id": "37",
      "title": "Memory Piece",
      "author": "Lisa Ko",
      "myRating": 2,
      "averageRating": 3.19,
      "yearPublished": 2024,
      "dateRead": "2024-08-09",
      "review": "This book sucked. Started okay but became unbearable."
    },
    {
      "id": "38",
      "title": "Real Americans",
      "author": "Rachel Khong",
      "myRating": 3,
      "averageRating": 3.95,
      "yearPublished": 2024,
      "dateRead": "2024-06-19",
      "review": "Really boring."
    },
    {
      "id": "39",
      "title": "Private Equity: A Memoir",
      "author": "Carrie Sun",
      "myRating": 4,
      "averageRating": 3.6,
      "yearPublished": 2024,
      "dateRead": "2024-06-11",
      "review": "Couldn't put it down! Kind of a mix of the book \"what my bones know\" (lots of undiagnosed c-ptsd) and the shows \"industry\" (without the sex) and \"billions\" I didn't realize this was a memoir for the first chunk of it - it reads like a novel! I definitely agree with other reviews, in that I don't buy that Sun didn't know what she was getting herself into. I question her rationale. She graduates from MIT, works in finance (for Fidelity) doing quant work, starts getting her MBA at Wharton, then drops out. She tells herself she wants a day job to support her writing but then decides to work as an EA for the most intense hedge fund ever. If she was straight out of college...maybe I could see her naivete but at age 29 after working in the industry and deciding not to get an MBA - she clearly knew what she was getting herself into. She knew she wouldn't be doing any writing - this wouldn't be just a \"day job\" to support her writing (she does no writing in the 2+ years at the fund). It also drove me nuts that she was an assistant when she was clearly capable of being an analyst or PM. WHY?? Why debase yourself like that? I will never understand. Oh also when she got back together with her ex - WHY CARRIE, WHY? Clearly I'm attracted to books about toxic corporate culture right now (\"exit interview\" was about how terrible working at Amazon is). I wonder why that is. I lived it so I really don't need to read more about it. I must feel like I have to validate my decision to drop out of the rat race..."
    },
    {
      "id": "40",
      "title": "Exit Interview: The Life and Death of My Ambitious Career",
      "author": "Kristi Coulter",
      "myRating": 4,
      "averageRating": 4.14,
      "yearPublished": 2023,
      "dateRead": "2024-06-02",
      "review": "Sooo depressing but well written and engaging. Makes me never want to return to the hell hole which is the corporate world!!"
    },
    {
      "id": "41",
      "title": "The Adult",
      "author": "Bronwyn Fischer",
      "myRating": 2,
      "averageRating": 3.68,
      "yearPublished": 2023,
      "dateRead": "2024-05-16",
      "review": "Not good. Shallow."
    },
    {
      "id": "42",
      "title": "Bright Young Women",
      "author": "Jessica Knoll",
      "myRating": 5,
      "averageRating": 3.98,
      "yearPublished": 2023,
      "dateRead": "2024-05-06",
      "review": null
    },
    {
      "id": "43",
      "title": "The Guest",
      "author": "Emma Cline",
      "myRating": 4,
      "averageRating": 3.27,
      "yearPublished": 2023,
      "dateRead": "2024-05-02",
      "review": "Very stressful. I need to know what happens!! Most relatable part of the book: \"Simon maintained such psychotic discipline because he seemed to believe even the smallest lapse in vigilance would result in catastrophe. And probably he was right. Occasionally the control dropped: Simon took a jar of peanut butter to the couch, eating with fastidious care until it was empty, the spoon licked clean by his surprisingly pink tongue. He gazed sadly into the scraped jar, as if oftended by the sight.\""
    },
    {
      "id": "45",
      "title": "Mexican Gothic",
      "author": "Silvia Moreno-Garcia",
      "myRating": 2,
      "averageRating": 3.66,
      "yearPublished": 2020,
      "dateRead": "2024-04-04",
      "review": "I did not enjoy this book one bit. For some reason at first I thought this was an Isabel Allende book. Lol so wrong. Anne Helen Petersen said she liked this book on the podcast \"what should I read next?\" Very disappointing. It was so boring. I kept waiting for a twist. Also the sexual scenes were very non consensual and made me deeply uncomfortable. I'm tired of the \"evil mushroom\" ploy (like hbo show \"the last of us\"). It's lazy."
    },
    {
      "id": "46",
      "title": "More: A Memoir of Open Marriage",
      "author": "Molly Roden Winter",
      "myRating": 3,
      "averageRating": 3.45,
      "yearPublished": 2024,
      "dateRead": "2024-03-10",
      "review": "This was kind of a blend of two other memoirs - splinters (Leslie Jamison) and group (Christie Tate). The author is brave and puts A LOT out there. I'm shocked that her husband and mother agreed to be included! It makes me deeply disturbed to know that she has teenage sons that can read this. I find the idea of monogamy forever stifling but I am much too jealous to ever share my partner with anyone. So I agree to long term comfort over short term excitement. I know that being wanted by others is exciting when it's new but will fade. I'm not convinced the author likes her life. I think she would much rather have a closed marriage but knows that her husband wants it to remain open. I feel sad for her because of this. It's clear that she values herself based on men wanting her. And the fact that she skipped a bunch of grades and entered college feeling behind has left a lasting impact on her love life. So interesting the way her life mirrors her mother's. This is frightening when I consider aspects of my mother that I dislike but employ (not sex stuff). I found parts to be really boring but ultimately I finished. Does her husband come from money or is making sounds for movies really that lucrative!? I was so bothered by her lack of acknowledgment of her privilege but at the same time, what did I expect her to say? \"Hey everyone, we are loaded and I never worry about what anything costs?\" I'd like to read a memoir that tackles the subject of open marriage written by someone more secure."
    },
    {
      "id": "47",
      "title": "Splinters",
      "author": "Leslie Jamison",
      "myRating": 2,
      "averageRating": 3.81,
      "yearPublished": 2024,
      "dateRead": "2024-02-24",
      "review": "This was a slog to get through. She is an excellent writer but I strongly dislike her as a person. She gets married after 6 months and is in couples therapy after another 6 months and then thinks it's a good idea to have a baby. Then she is surprised when that doesn't fix anything. I also hate when mothers are martyrs and she is the ultimate. She doesn't let her husband do anything to help with childcare but she complains the whole time that she's doing it alone. Also there was no mention of the fact that her ex already had a daughter so maybe he wasn't such an inept father and could have handled some of the responsibilities. Ugh this was a hate read. She has no perspective. Lots of people criticize memoirs that are written in real time because the author hasn't grown from the events yet and this is definitely the case here."
    },
    {
      "id": "48",
      "title": "Tom Lake",
      "author": "Ann Patchett",
      "myRating": 2,
      "averageRating": 3.93,
      "yearPublished": 2023,
      "dateRead": "2024-02-17",
      "review": "what a BORE!!!"
    },
    {
      "id": "49",
      "title": "Goodbye, Vitamin",
      "author": "Rachel Khong",
      "myRating": 5,
      "averageRating": 3.74,
      "yearPublished": 2017,
      "dateRead": "2024-02-15",
      "review": "Finally a good book in 2024! I only want to read books that authors I like recommend. I googled \"what is weike wang reading?\" and found this one. I had insomnia and acid reflux and couldn't sleep so I stayed up all night reading this. It's delightful."
    },
    {
      "id": "50",
      "title": "My Husband",
      "author": "Maud Ventura",
      "myRating": 3,
      "averageRating": 3.65,
      "yearPublished": 2023,
      "dateRead": "2024-02-12",
      "review": "I think I am supposed to find this book witty but I don't."
    },
    {
      "id": "51",
      "title": "Mercury",
      "author": "Amy Jo Burns",
      "myRating": 2,
      "averageRating": 3.79,
      "yearPublished": 2024,
      "dateRead": "2024-02-09",
      "review": "So soapy. No depth. Similar to \"hello beautiful\" but worse. I had insomnia so I finished it (a hate read)."
    },
    {
      "id": "52",
      "title": "None of This Is True",
      "author": "Lisa Jewell",
      "myRating": 3,
      "averageRating": 4.08,
      "yearPublished": 2023,
      "dateRead": "2024-01-22",
      "review": "I was very interested until about halfway through... then I got bored. There was no twist because you already knew what was going to happen. The ending wasn't a twist. It was just a lame obfuscation. ALSO after recently watching \"may december\" I am very tired of directors/authors using stories of adults sleeping with children as entertainment."
    },
    {
      "id": "53",
      "title": "Wellness",
      "author": "Nathan Hill",
      "myRating": 2,
      "averageRating": 3.98,
      "yearPublished": 2023,
      "dateRead": "2024-01-22",
      "review": "Much too long. So many useless chapters. I have been feeling sickly so I listened to it while dozing. Would not recommend."
    },
    {
      "id": "54",
      "title": "Central Places",
      "author": "Delia Cai",
      "myRating": 3,
      "averageRating": 3.49,
      "yearPublished": 2023,
      "dateRead": "2024-01-17",
      "review": "Not good. This book was just so...unnecessary. The main character had no depth. It all happened \"just like that,\" devoid of emotion or reflection. The author of \"Flawless\" (Elise Hu) had this as her 2nd favorite book she read in 2023, so now I can't trust anything she says even though she has a cool blog and I wanted to like her."
    },
    {
      "id": "55",
      "title": "Ripe",
      "author": "Sarah Rose Etter",
      "myRating": 2,
      "averageRating": 3.59,
      "yearPublished": 2023,
      "dateRead": "2023-12-26",
      "review": "What a depressing book. What was the point?"
    },
    {
      "id": "56",
      "title": "Slow Motion: A Memoir of a Life Rescued by Tragedy ‚Äì A Powerful Coming-of-Age Autobiography of Rebellion and Family Survival",
      "author": "Dani Shapiro",
      "myRating": 3,
      "averageRating": 4.04,
      "yearPublished": 2010,
      "dateRead": "2023-12-24",
      "review": "I struggled to finish this. She was just so tone deaf. Lenny's money really bothered me. I was stressed out by how little she cared about the rules of living. What happened to all of her unpaid bills? Who paid her expenses after she left Lenny? She sold a car he gave her for graduate school? She says this all so casually! Losing her father is traumatic but she was such a cold person. I didn't care about her wellbeing. There was no arc. She didn't learn anything. She just decides to finish school. Bravo? I've tried to read other books by her and couldn't finish. Might not continue trying."
    },
    {
      "id": "57",
      "title": "Hello Beautiful",
      "author": "Ann Napolitano",
      "myRating": 4,
      "averageRating": 4.13,
      "yearPublished": 2023,
      "dateRead": "2023-12-11",
      "review": "I couldn't put it down! I didn't like the ending though. I also felt like these women were too unforgiving. But I guess I am too...William was a hollow character. The author thanked draymond green in her acknowledgments so that was hugely disappointing."
    },
    {
      "id": "58",
      "title": "The Woman in Me",
      "author": "Britney Spears",
      "myRating": 5,
      "averageRating": 3.83,
      "yearPublished": 2023,
      "dateRead": "2023-11-12",
      "review": "I had absolutely no intention of reading this book but Spotify just announced that (select) audiobooks are included with premium (they had said they were previously included but were locked/paywalled) and they are pushing Britney's memoir. I'm so glad and sad to have listened to it. It's so terrible what the world did to her. And mainly what her disgusting family did to her. It's a feminist text. Truly eerily similar to how we treated witches, just like Britney says. I do wonder who her ghost writer is because I can't imagine she actually wrote this. But I do know all the stories are real. It helps explain how she behaves now (childlike). I'm devastated for her. I am so happy that she is alive and did not choose to end her life. She is a ray of light and her desire to heal is inspiring. I hope others give this book a chance. I sobbed many times. —- I have not been through anything like the abuse that Britney has suffered but I related so hard to how she was never good enough in her family's eyes. She did EVERYTHING they wanted and it was never enough!! — The part about shaving her head...I felt that SO deeply. You want me to be beautiful? Fuck you."
    },
    {
      "id": "59",
      "title": "Comfort Me with Apples",
      "author": "Catherynne M. Valente",
      "myRating": 2,
      "averageRating": 3.56,
      "yearPublished": 2021,
      "dateRead": "2023-09-29",
      "review": "This did not work for me. Downgrading to 2 stars from 3."
    },
    {
      "id": "60",
      "title": "Pineapple Street",
      "author": "Jenny Jackson",
      "myRating": 3,
      "averageRating": 3.55,
      "yearPublished": 2023,
      "dateRead": "2023-09-23",
      "review": "I loved the first half but then Georgiana became absolutely insufferable and the whole white savorism complex was too much."
    },
    {
      "id": "62",
      "title": "Big Swiss",
      "author": "Jen Beagin",
      "myRating": 3,
      "averageRating": 3.68,
      "yearPublished": 2023,
      "dateRead": "2023-09-03",
      "review": "Not sure how I'm supposed to feel about this book. Reminded me of \"the rabbit hutch\""
    },
    {
      "id": "61",
      "title": "Yellowface",
      "author": "R.F. Kuang",
      "myRating": 4,
      "averageRating": 3.73,
      "yearPublished": 2023,
      "dateRead": "2023-08-31",
      "review": "Engrossing! Is this a satire of \"American dirt\"? Or is that just a dumb white woman's interpretation? Made very weary of traditional publishing! https://youtu.be/JUdFkRdgPDU?si=wmc6zoh9FNiKdSM8 This analysis is"
    },
    {
      "id": "63",
      "title": "I Have Some Questions for You",
      "author": "Rebecca Makkai",
      "myRating": 4,
      "averageRating": 3.59,
      "yearPublished": 2023,
      "dateRead": "2023-08-24",
      "review": "Couldn't put it down!!"
    },
    {
      "id": "64",
      "title": "Natural Beauty",
      "author": "Ling Ling Huang",
      "myRating": 4,
      "averageRating": 3.79,
      "yearPublished": 2023,
      "dateRead": "2023-06-17",
      "review": "I couldn't put it down! It's too close to home... So disturbing to see our culture's obsession with beauty, youth and wellness so bluntly laid out. Makes me want to jettison the spendy tinctures in my bathroom (and I only have a few!) I have always felt deeply flawed for not having a skin care routine. I don't know what a toner is. I put expensive oil on my face and then slather on some cheap alba botanica moisturizer. Am I doing it right? I am embarrassed to admit that I want to emulate Gwyneth. Now I am convinced she's another Ghislaine Maxwell (she's not) who is keeping women down. I read Anne Helen Petersen's substack \"culture study\" and she recently interviewed Elise Hu, who wrote a book on K-Beauty and aesthetic self-optimization (Flawless: Lessons in Looks and Culture from the K-Beauty Capital) \"Our physical appearance gets conflated with the self (even though the concept of the self is so much more nuanced and richer than exteriors), and so a lot of us have internalized the notion of self-care as skincare, or costly treatments. That means there's a thin line between nurturing our bodies in a way that is caring and sensual, and falling into extractive beauty work that benefits powerful interests.\" Hu goes on to say \"we should challenge the system instead of judging the woman\" - this one is the hardest part for me!!! I want to shake my friends who get Botox and yell \"don't you see you are doing exactly what capitalism wants you to do!?\" But it's not their fault, it's the system. And I feel helpless and sad. This also made me think of my mixed feelings about Emily ratikowski. Can a woman demand respect while topless? And profiting off of pandering to the male gaze? I am not sure! Blame the system not the woman... \"we need a kinder relationship with ourselves, and by extension, a kinder relationship with each other...I see beauty culture as hustle culture that's reached into our bodies. Hustle culture as applied to disciplining or modifying our bodies isolates us from one another because we end up in competition, looking over our shoulders, and scared to ask for help when we need it. It's a recipe for inequality and marginalization on one end, and anxiety and exhaustion across the system. If we look to nature as a guide, the foundation of a well-lived life and a healthy social ecosystem is actually built on mutual care. So just as we millennials (with enough privilege to do so) need to remap our relationships with work, we can also remap our relationships with aesthetic work. I learned to take a beat and reflect on the ways that we almost automatically adhere to the notion that our worthiness boils down to our looks, and from there, began to untangle that knot. Liberating ourselves from appearance shame is an issue of bodily autonomy —¬†and a matter of social justice —¬†because it informs how we can show up in the world and participate in it.\" OOF"
    },
    {
      "id": "69",
      "title": "The House in the Pines",
      "author": "Ana Reyes",
      "myRating": 2,
      "averageRating": 3.1,
      "yearPublished": 2023,
      "dateRead": "2023-06-10",
      "review": "What a bore."
    },
    {
      "id": "83",
      "title": "Big Friendship: How We Keep Each Other Close",
      "author": "Aminatou Sow",
      "myRating": 3,
      "averageRating": 3.74,
      "yearPublished": 2020,
      "dateRead": "2023-05-21",
      "review": "Waffling between two or three stars and decided to be charitable. It was really boring and I never would have finished it if it hadn't been chosen for a book club that I recently joined. The authors simply are not very interesting. I'm amazed this book was published. The idea is solid but the execution is SO underwhelming. Maybe if I had heard of their podcast I would care?"
    },
    {
      "id": "66",
      "title": "My Nemesis",
      "author": "Charmaine Craig",
      "myRating": 5,
      "averageRating": 3.4,
      "yearPublished": 2023,
      "dateRead": "2023-05-16",
      "review": "Loved every minute of it. So much to ponder. -- The main character is flawed and selfish and I worry I am her. Isn't that what books are all about? Seeing ourselves reflected back? This book had so many delicious quotes: \"There are those who can't keep sight of themselves and those who can't keep themselves out of their own sight\" Can you imagine which one is me and which one is my husband? Why do I have to condemn my husband in the process of condemning myself? \"So what does that make us, Camus and me and someone like Charlie? Fantasists like Don Juan? Or only people who need, now and again, to seek refuge from the reality of their lives, the truth of themselves?\" I love when a book seeps into my psyche and I feel like I am sharing thoughts with the narrator after I finish the book. A book hasn't grabbed me like this in AGES and I am so pleased. \"It is a matter of limits. I am here. Htet is there. There is no question of her rage doing me harm. No question of my using her rage to punish myself. It is her own self-punishment. And she is learning to reconcile herself with what has been, to see that she is worthy of a life without self-harm.\" This quote is about a victim of human trafficking so I feel insane relating to it but I like the framing. I am worthy of a life without self-harm. Self-harm can take many forms and I see that my internal criticism is self harm (even though it has \"helped\" me \"accomplish\" things) The book meditated on a lot of themes that I grapple with - motherhood and femininity. I feel enraged by the choices I have - to be aloof like my mother or all consumed by motherhood. \"And what is a parent, finally? The person who puts in the time? Or also the person whose attention—in light of the one known as \"child\"—isn't overly co-opted by other sights?\" It feels so gross to still be so obsessed with my mother's \"coolness.\" I know I am just as cruel (if not more so) as her. Yet we are both precious, sensitive little flowers - although we puff up to cover our insecurities. \"I tried to describe the way it feels, to meet your daughter when she's already formed, already harmed by men, and someone capable of looking at you with profound skepticism. If I'd known her before the damage, if I could have prevented it, protected her as a little girl . . .\" A man says this of his adopted (trafficked) daughter and it enraged me. Because ultimately every girl will be harmed by men (and women). \"Aside from her credulousness, I didn't like the uniformity of her speech, or the symmetry of her hair's layers and highlights, or the shape of her eyebrows and lips, perfected to give her half-frozen face a perpetually sardonic sultriness. Nor did I care for the enhancements peeking out from the deep V of her T-shirt's neckline. Yes, this is a record of meanness and, I admit, perhaps also one of anti-feminism, of how merciless women can be in scrutiny of one another and of how far we may go to prove ourselves enough to be liked.\" I just had dinner with my in laws and my MIL said she was never competitive with her friends - only in sports. And I said I've always been very competitive with my friends. Then I deflected with what I said with Elise on the podcast about how it manifested in the corporate world because women are made to feel there is only so much space for women in the boardroom. My MIL said because she was a teacher she never felt that. But I call bullshit. I have been competing against women in a non-sport context for as long as I can remember. Every interaction with a woman has come with a comparison for me. Who is prettier? Who is thinner? Smarter? Richer? Better? And it taints my whole way of being. If I am \"better\" - I can be my whole self because I don't feel like I have \"something to prove.\" But if she is \"better,\" I make it my mission to be liked or to puff up and be just as good and this is insincere and makes them dislike me. And even if I am completely sincere, people will still dislike me and this drives me INSANE! Why do people like [person I went to high school with] go out of their way to de-friend me on Facebook? Am I so evil? The narrator of this book is a contrarian/instigator and I relate to her too much. I know I have been a mean person. The narrator (Tessa) hates the wife of a man she likes because she (Wah) represents the opposite end of the feminine spectrum - so demur, passive, and desperate for male approval. I have felt this wrath towards so many women. \"There are times when I can't distinguish my habit of honesty from brutality. The look on Charlie's face then was harrowing, broken and shamed. I suppose if I'd been a more \"feminine\" woman, someone willing to sacrifice her sense of truth for his masculine pride, I would have immediately found a way to recant my diagnosis or to apologize\" !!!! AHHH !!! There are times when I can't distinguish my habit of honesty from brutality...many times..."
    },
    {
      "id": "82",
      "title": "My Last Innocent Year",
      "author": "Daisy Alpert Florin",
      "myRating": 4,
      "averageRating": 3.72,
      "yearPublished": 2023,
      "dateRead": "2023-05-11",
      "review": "Enjoyed the first half more than the second. Captured a very specific time of life. I'm currently attending a college graduation and this is making me nostalgic in a way."
    },
    {
      "id": "95",
      "title": "One True Loves",
      "author": "Taylor Jenkins Reid",
      "myRating": 2,
      "averageRating": 4.02,
      "yearPublished": 2016,
      "dateRead": "2023-04-30",
      "review": "Read for a book club. Would never have picked this up otherwise. I am very confused why people enjoy this book. First, the castaway story. Come on... Second, her internal turmoil is inane. All the saccharine \"profound\" musings on love...I can not Some reviews said they liked the ending so I kept waiting for something to happen. Nope nope. So predictable and just...terrible. No more Taylor Jenkins Reid for me. Ever again. I've given her too many chances. She is the Sarah dessen of 30 something's. So trite. Two stars or one?"
    },
    {
      "id": "113",
      "title": "Glow in the F*cking Dark",
      "author": "Tara Schuster",
      "myRating": 4,
      "averageRating": 3.91,
      "yearPublished": 2023,
      "dateRead": "2023-04-02",
      "review": "I applaud Tara's commitment to healing and sharing her vulnerability. I didn't love this one as much as \"buy yourself the fking lilies\" but I think that's because I've done a lot of self reflection and most of her advice in her first book was about \"re-parenting\" herself (aka how to be an adult), which is still hard for me (how do people keep their kitchens clean all the time?!) My heart broke for little Tara and her brutal childhood. I want to give her the biggest hug. I love that she touches on money issues. I have LOTS of money issues and I felt deeply seen. I am inspired to examine this about myself instead of pretending it doesn't exist. I'll have to call my buddy khe hy too... She didn't wait for anyone to give her permission, she just started being the person she wanted to be. I love that for her and want that for me!!"
    },
    {
      "id": "91",
      "title": "Between Two Kingdoms: A Memoir of a Life Interrupted",
      "author": "Suleika Jaouad",
      "myRating": 5,
      "averageRating": 4.42,
      "yearPublished": 2021,
      "dateRead": "2023-03-27",
      "review": "This memoir is achingly beautiful. The writing is like butter. 3/28/23 It's 7:30 am and it's snowing a lot. It snowed a lot overnight too. We have a cute little rover with us this week, an Australian Labradoodle named Sadie. She's very high energy. I am sitting on the couch drinking coffee with raw milk as it dumps snow. Coziness level 10/10. Taylor Swift's \"Lavender Haze\" is stuck in my head. I don't even like that song very much. Is that James Vincent McMorrow on vocals in the background? I can't tell. I finished listening to \"Between Two Kingdoms\" yesterday. It's a memoir written by a half Tunisian, half Swiss woman, named Suleika Jaouad, (by the way, Suleika is perhaps the most beautiful name that I have ever heard - and it means \"most beautiful woman\") who gets diagnosed with leukemia at age 22. Most of the book is about her experience with chemo and frequent hospitalizations. The last bit of her book is kind of like her version of \"Wild,\" where she road trips across the country meeting the people that wrote her letters when she was sick. I could not put her story down. There were many negative Goodreads reviews that called her selfish and privileged. Are there some contractions she doesn't address? Attending Princeton - supposedly only because she received a full scholarship. Yet, her parents own an apartment in the East Village in Manhattan that she stays in during her treatment. Her parents also own a cabin in Vermont. She also played the double bass growing up, an instrument that certainly wasn't offered at my public school... But to the point about her being selfish - give me a break! She acknowledges that sickness robs you of your humanity and she knew she wasn't the best version of herself. How can you not be self consumed when dealing with life or death? Why do I love to read negative Goodreads reviews?! I used to think it was only applicable when I also hated the book but I've realized that I seek them out even when I love the book. I guess I just love reading dissenting opinions. After I finish a book, I go into a rabbit hole about the author. The fact that her \"Jon\" is JON FREAKING BATISTE - are you kidding me?! Who meets Jon Batiste at band camp at age 13?! Obsessed. We played \"Freedom\" at our wedding and it was pure joy. Everyone thinks \"Will\" - her boyfriend that stays with her through her diagnosis and bears the brunt of caretaking duties - deserves more recognition. Again, I feel like she did this. She acknowledged how much he did for her, but she also wrote about how she felt (this is her memoir people!) I listened to her interview on \"Mom's Don't Have Time to Read Books\" (how does Zibby read so many damn books, someone please explain also, didn't know Zibby could be a name either) and she mentioned that Melissa Febos was her advisor - which 100% tracks because both authors write with such elegance and beauty that it makes me want to set myself on fire because I will never be able to write like that. She also said Cheryl Strayed told her that \"we write the book we were meant to write, not the book we want to write.\" How can I get these same women to advise me, sheesh! I loved the book. I love the idea of turning pain/illness into art. Writing is my form of processing as well, even though I have never experienced any trauma so I tell myself that my writing is not \"real.\" One con: I will admit this book was way too long. I kept listening and was like \"how am I only X% of the way through!!\" So yes, the editing could have been better. But at the same time, I was never bored, I was enthralled by her story and her writing. A must read IMO! OH! I'd be REMISS if I forgot to mention infertility!!! How in the HOLY HELL is it okay for people not to be told that they are going to be infertile post chemo? She said she used Fertile Hope to freeze her eggs. I used to babysit for a woman, Joyce, who was employee #2 at Fertile Hope, a company started by Lindsay Beck. Beck got tongue cancer at age 22 and was appalled when she found out that NO ONE WAS PLANNING ON TELLING HER THAT POST TREATMENT, SHE'D NEVER BE ABLE TO BEAR CHILDREN. I must dedicate my life to this cause. Beck's mission was to make it a law that doctors had to mention this to patients and she succeeded. But the fact that Suleika had to bring this issue up herself shows that MORE MUST BE DONE. You can't just bury infertility as a list of side effects!! This must be discussed. And another fun fact is that fertility treatment isn't covered by insurance! Isn't being a woman the best!? And being a woman with cancer is just the cherry on top. So now the woman I used to babysit for dedicates her life to ensuring fertility preservation is covered by insurance. What have I been doing with my life? Finance and business operations for tech companies? When Joyce is out there crusading for women and literally making dreams come true? I feel like the scum of the earth. How do I help!?"
    },
    {
      "id": "90",
      "title": "The Measure",
      "author": "Nikki Erlick",
      "myRating": 4,
      "averageRating": 3.97,
      "yearPublished": 2022,
      "dateRead": "2023-03-22",
      "review": "I was intrigued throughout even though I don't usually enjoy books with a bunch of different narrators. It was a page turner. I didn't care that much about the romance story lines but they didn't detract. Lots of interesting moral questions raised. I don't think I would look at my string but I'm torn!!!"
    },
    {
      "id": "112",
      "title": "BFF: A Memoir of Friendship Lost and Found",
      "author": "Christie Tate",
      "myRating": 4,
      "averageRating": 3.75,
      "yearPublished": 2023,
      "dateRead": "2023-03-12",
      "review": "I enjoyed her first book, \"Group\" (even though it was annoying because she was OBSESSED with finding a man and it got OLD and her therapist sounds incredibly problematic...) because she gave a voice to a lot of thoughts that make me feel defective for feeling. It is nice to read the petty stuff - she fully admits to friendship jealousy and judgement that I feel like I am not supposed to feel. It brought up lots of uncomfortable stuff about my friendship breakups..."
    },
    {
      "id": "115",
      "title": "Life Will Be the Death of Me: . . . and you too!",
      "author": "Chelsea Handler",
      "myRating": 4,
      "averageRating": 4.05,
      "yearPublished": 2019,
      "dateRead": "2023-03-06",
      "review": "I loved it! She looked herself in the mirror and actually tried to decipher what she thought about herself. The stuff about her brother and her childhood was tough. I would love to hang out with her. She's so fun."
    },
    {
      "id": "116",
      "title": "Have I Told You This Already?: Stories I Don‚Äôt Want to Forget to Remember",
      "author": "Lauren Graham",
      "myRating": 4,
      "averageRating": 3.67,
      "yearPublished": 2022,
      "dateRead": "2023-03-05",
      "review": "The story about her dog and her mother is so touching. I love her essays and completely agree that Nora should not have had to worry about her neck!! TIL that celebrity talk shows are scripted!! So disappointed."
    },
    {
      "id": "89",
      "title": "What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen",
      "author": "Kate Fagan",
      "myRating": 4,
      "averageRating": 4.23,
      "yearPublished": 2017,
      "dateRead": "2023-03-01",
      "review": "Would this story have been written if Maddy was not a beautiful, Ivy league athlete? Absolutely not. But I, too, fell into the trap of \"but she was so pretty\" - as if being good looking makes you immune to the difficulties of life. I see a lot of myself in Maddy. I have never handled failure well. School made sense to me. I have always equated my self worth to an external marker, first grades, now salary. To me, self worth depended on success. I am just now realizing that self esteem may fluctuate but self worth is steady - a deep knowing that you are enough. Right now this concept is abstract but I'm working towards a base level of self regard, that does not rely on external success factors. Maddy was a freshman at Penn on the track team who killed herself in January 2014 (eerily on my birthday...) I don't remember her but I probably read a headline about her back then. This book has softened my stance on athletes and mental health - or more broadly fame/pressure and mental health. I used to think that it was complete bullshit that Simone Biles dropped out of the most recent Olympics due to \"mental health.\" I did not see this as a heroic act in the slightest. I saw it as a cop out because she wasn't doing as well as she wanted. But I found it hypocritical because she had been ALL over tv cashing in on the upcoming Olympics. She was in soooo many ads. So I was very annoyed when she dropped out. She should have to give all that endorsement money back! What a fraud! Same with Naomi Osaka, the tennis star. Same with Jonah Hill - you can't just opt out of doing PR - that's part of your job! But after listening to the first chunk of this book, I have a lot more empathy. First, I had forgotten how unbelievably disorienting and stressful freshman year of college was. I had a really hard time. I have repressed these memories and reframed college as a magical time. But it certainly was not. I stopped sleeping. I stopped going to the bathroom (I will never forgive Cal for its co-ed bathrooms - HORRIBLE). I had no idea how to feed myself. I discovered pretzel goldfish in the Unit 3 grab and go section of the cafeteria. I felt like a complete fraud and failure. I didn't get into the \"right\" sorority. I didn't know what to major in. I didn't get straight A's. It was brutal. The pressure was relentless. And at the same time, I wasn't under any pressure but I felt like I was drowning. After working so hard in high school to get to college, I felt completely bereft. I had no map to follow. Life had been so prescribed - take AP classes, play sports, do extra curricular - all to get into the best college you can to eventually get the best job you can. But how were those four years supposed to go? Well I was \"supposed\" to apply to the business school but I was too intimidated. Everyone at Cal was so self assured. My roommate was a double major (she ended up not graduating with either of those majors but at the time I felt like I was supposed to know what to do). I am still perplexed by those who came in as declared engineering majors. What is engineering? I still don't know. How did they know they wanted to be engineers??? A friend of mine tried to transfer into engineering and didn't get in. So really you have to know before you even apply. So at age 17 you must know that you want to be an engineer. But there are no engineering classes in high school. Someone please make it make sense! It has to be that their parents were engineers. So if you're parents aren't engineers, you will never be one. Another friend came in declared as an EECS major - electrical engineering and computer science - what is electrical engineering!? I made one friend that wasn't in my sorority freshman year. She had dropped out of sorority rush because she hated it. She left Cal after freshman year and transferred to UC Irvine to be near home. She told me how much she hated Cal and I tried to encourage her to join a sorority because that had been the only method for me to make friends. The school was simply too big and overwhelming. Berkeley didn't give a shit about you. If you didn't try exceedingly hard, you would surly be swept under. Maddy feels similarly swallowed by Penn. It seems like everyone else is effortlessly gliding along when you are drowning. I've never had suicidal ideations - for the most part, sometimes things do get really dark but never to the point where I think of taking my own life - sometimes I do want to just sleep forever though. This is the thing I realized - you truly never know what someone else is feeling. What is a \"good day\" to someone else compared to your version? What do I know about the pressure that Simone Biles was feeling? I will NEVER know how she was feeling - because you can never truly get inside someone else's head. It's easy to sneer and judge - pressure is part of the job of being a famous athlete/actor! But I truly will never know the stories that their brains are telling them and it's their life so they get to make their own decisions. It's so easy for me to look at beautiful Madison Holleran and say, \"if only she had just held on and gotten help.\" But the voices in her head were too loud. Life is hard but it is so so worth it. I want to be alive so much. I am so sad for those who do not get to keep having birthdays. They remind me how much I treasure life. They remind me to breathe deeply and to not hold back. I don't want to play it safe and follow the rules. I want to live my life in a way that aligns with my values. They remind me that nothing is guaranteed. Even if I wake up groggy and cranky and I haven't been sleeping well. I can snuggle my sweet perfect dog. I can drink coffee and watch the snow fall. I can hug my wonderful husband. I have built this sweet little life and I truly cherish it. I don't want to ruminate on my imperfections. Don't regret growing older, it's a privilege denied to many. Heres are some quotes that stuck out to me: Of course, what remained hard to understand was the effect this would have on Madison's psyche. She had never handled failure, even the garden-variety kind, well. During high school, Madison once finished fourth in the 400 hurdles at a county meet—much worse than expected. She started crying and asked to leave the event, even before cooling down. \"She had a tremendous work ethic, and she worked hard at everything she did,\" Stacy said. \"**But she just put so much pressure on herself.\"** In high school, Madison won constantly, and that steady stream of victories strengthened her fragile psyche. But once she was at Penn, Jim and Stacy, along with her older sister Carli, began to notice the erosion of Madison's confidence. When Maddy was in middle school, she would walk to school in the mornings with kids in the neighborhood. As the year went on, she started timing how long the walk took. Once she had that specific number, she needed the next day to be faster, and the day after that, faster still. By the end of the year, she was speed-walking, occasionally breaking into a jog, to beat the previous day's time. **There was something satisfying, calming almost, about controlling time and output in this way. She had created these little tests for herself, ones that she was fairly certain she could pass.** **Maddy was addicted to progress, to the idea that her life would move in one vector—always forward, always improving—as opposed to the hills and valleys, the sideways and backward and upside down, that adults eventually learn to accept as more closely resembling reality.** Maddy was not unique in feeling this way. Much of young adulthood is presented as a ladder, each rung closer to success, or whatever our society has defined as success. Perhaps climbing the ladder is tiring, but it is not confusing. You are never left wondering if you've made the wrong choice, or expended energy in the wrong direction, because there is only the one rung above you. Get good grades. Get better at your sport. Take the SAT. Do volunteer work. Apply to colleges. Choose a college. But then you get to college, and suddenly you're out of rungs and that ladder has turned into a massive tree with hundreds of sprawling limbs, and progress is no longer a thing you can easily measure, because there are now thousands of paths to millions of destinations. And none are linear. School had always been straightforward: collect a specific set of numbers and letters, and receive your desired grade. That was not confusing; that was reassuring. In high school, she had the perfect—well, everything,\" Justine said. \"She always stood out. But now, she wasn't fully seeing her success, or all of her work paying off. **Maddy often expected the worst.** To her, the prospect of failing out of Penn did not feel like hyperbole; it felt like the probable outcome. How could she believe otherwise, when she had no concrete evidence to the contrary? Everything had been flipped on its head, had become abstract. She was finishing behind a hundred other runners and was told that was good. She knew only half the answers on an art history test and was told not to panic. Freshman year of college, especially for those playing a sport, is like walking through an obstacle course wearing a blindfold. No context exists for how hard the workouts will be, how long they will last, what each class will be like, what events are fun, what should be avoided. There is no yin-yang, either; no understanding that one week might feel grueling, unmanageable, but just hang on, because the following week will be light and easy. **For someone who struggles with the unknown, freshman year of college can feel like walking a path lined with land mines—heart racing, disaster around every corner.** Now add another variable: mental health."
    },
    {
      "id": "88",
      "title": "A Heart That Works",
      "author": "Rob Delaney",
      "myRating": 5,
      "averageRating": 4.62,
      "yearPublished": 2022,
      "dateRead": "2023-02-25",
      "review": "How can you rate this book? Don't read it on a Saturday night or on any night. Gutted. Can't stop sobbing. Life is so awful."
    },
    {
      "id": "110",
      "title": "Drinking Games",
      "author": "Sarah Levy",
      "myRating": 4,
      "averageRating": 3.76,
      "yearPublished": 2023,
      "dateRead": "2023-02-11",
      "review": "Is she insanely privileged? (Therapy 2x/week, an MFA program, manifestation workshops...) Yes. Did I enjoy her memoir? Also yes. It felt like my memoir. Makes me want to quit drinking. I wonder what school she went to before transferring to Brown and what start up she worked at. Wish she talked more about the mechanics of getting sober and things like going to bachelorette parties sober. Loved her part on manifestation and contentment. # 2/18/23 - \"Drinking Games\" Book Review One week ago, on Saturday, February 11th, I read the book, \"Drinking Games\" by Sarah Levy in one sitting. It was truly my memoir. As I mentioned, I begin each year devouring \"quit-lit\" books - which are memoirs about getting sober. The fact that this is a pattern I repeat annually should tell me something that I clearly do not want to acknowledge. \"I was starving for outside approval in all areas and drinking and getting dressed were no exception. I wanted to wear the cool labels in middle school and drink the right way in high school. I paid attention to my peers and shapeshifted so I would fit in. I sought out short-term gratification in miniskirts and tequila shots and hoped they would make me feel desirable, but the next morning I still felt like an imposter. Like my drinking, I struggled with moderation when it came to my clothes; nothing was ever enough. I was either wearing the same skinny jeans every weekend or drunkenly online shopping every night. When I was spit out into the \"real world\" at twenty-two, I felt vulnerable and lost, so I kept hiding in my clothes and cups.\" Levy's struggles with body image, self love, friendship, relationships, clothing, wellness, work all mirror my own thoughts about wanting to fit in and be accepted. Essentially she would shape shift in order to be liked. Quitting drinking allowed her the space to actually take stock of who she was and who she wanted to be. She let go of the noise of who she \"should be\" in order to fit in. So much of the messaging towards females is: be small, be quiet, be pretty, dress well, have a lot of friends, and most importantly, have a partner - do NOT be alone. Capitalism and social media sends you a barrage of images that say \"YOU ARE NOT ENOUGH.\" You are not thin enough, you are not rich enough, you are not luxurious enough. Without this cream, this vacation to Europe, this engagement ring, you are broken, wrong, inferior to others. She had some profound insights that felt like lightbulbs flashing in my brain. A few revelations: - **How you dress is a reflection of how much you value yourself.** Brain explodes! She details her fraught relationship with clothing. She was raised to see clothing as a frivolous interest, as was I. Shopping has always been such a loaded topic and endeavor. My mother dresses like a blind bat. She loves teal so everything she owns is teal. She thinks it's perfectly acceptable to pear tight teal leggings with teal clogs and a teal scarf. All this to say, my mother and I do not share the same fashion tastes. I grew up shopping at the nearby TJ Maxx. We went to Mervyns for back to school shopping. These are not places that specialize in quality clothing. This is bottom of the barrel shopping. We weren't poor but clothing was not prioritized. My mom's email address is couponlady (couponqueen was taken) and it shows. She often gets money back after a Safeway trip. She won't buy anything that is not on sale. This is how I live my life - the cheaper is better. One of my closest friends was not raised this way. She has absolutely no problem dropping top dollar on nice things. It makes my brain explode. How does she justify it??? Does she think she deserves nice things?? At my bachelorette party, I was using a device the is a blow dryer that is also a round brush so it gives you a blow out type effect. I bought mine for $20 at TJ Maxx (it was my 2nd or 3rd because surprise surprise cheap stuff doesn't last that long??) My friend said \"what a wonderful device I want one!\" She went home and ordered one from Drybar (which I wrongly confused with Dyson so I thought she had spent $500+ on device she saw once and wanted). The Drybar one is not nearly as expensive as the Dyson one, but it is still 5x what I was spending on myself. And she didn't give this a second thought. She discovered Vuori clothing (soft AF clothing from San Diego) and didn't bat an eye at buying 5 things. I agonized for well over a year at buying one pair of pants. Why am I this why?? Why do I feel that I am underserving?? My friend has tons of cute Paige jeans that are perfectly tailored to her body. I have a few pairs that do not fit me because I bought them at Nordstrom Rack and therefore they are not in a fit or style that I like. WHY? I can't seem to grasp that I am worth investing in nice things. It truly hurts my soul to spend money on myself. It's a problem. Shopping makes me feel wracked with guilt. I took a look at my closet last night and realized that every other piece was given to me by someone who didn't want it. I have multiple huge purple puffy jackets that I absolutely never would have picked out by choice. But they work! They keep me warm. Isn't that enough!? I am grateful that people chose to give them to me. The remainder of my clothes that are not hand me downs are from the little girls section of Old Navy. Not only do I only think I deserve clothes from Old Navy (not shade it's just not where anyone else I know on the planet shops because they all think it is beneath them), but I also do not think I deserve women's clothing. I save by buying clearance items from the girls section. This feels very sad to actually type out. I convince myself that I have figured out a secret money saving loophole because I am petite and can get away with buying XL or XXL girls clothing. But really what this means is that nothing I own is nice and form fitting. It's mostly bag type clothing made for 14 year old girls. I am 31 years old. Why can't I allow myself to dress like one? I want to be able to tuck in my tops to my (ill-fitting) jeans but since all of my clothes are loose, this looks terrible. Getting dressed is very disheartening because I truly do not like anything I own. I know I need to change how I view myself but my self worth is so conditional. I don't have a consistent stream of self worth. I have been trying to read this book \"Good Morning, I Love You\" for what feels like 100 years and in it the author describes how self esteem is fleeting and conditional, while self compassion is steady and consistent. I do not know how to not be fleeting. Everyday is a new roller coaster of torture. I wake up - if I don't work out then I am a failure and my day is ruined. If I don't eat \"clean\" (no sugar, no dairy, no grains, no alcohol), then I am a failure. If I don't \"accomplish\" anything, then I am a failure. So every day I feel like a complete and total failure. I have a habit tracker in my bullet journal and every week I tell myself I am going to the following daily: Exercise, Eat Clean, Write, Meditate, Floss, Walk 10k steps. I write this out weekly in a grid and check a box for each daily activity. I haven't meditated...well ever and yet I have been writing this same grid out for 3+ years. I don't \"celebrate\" wins, I ruminate in losses. It is incredibly demoralizing. And yet I can't stop. I listened to the audio version of the book \"The Bullet Journal Method\" at the end of 2018 when we were roadtripping in New Zealand and I felt like I had found the solution to my life's problems. I love planners but I have always struggled to find the \"right\" one. Now I could make my own! And I could track everything! The point was to help create better habits so you could get closer to your goals and to record how you actually spend your time so you could see your current self more clearly. The point was not to trap yourself in a weekly grid of self loathing. But yet here we are. I take most things and turn it into a cage. Why? How to stop? Bullet journaling felt great in the beginning because I LOVE structure. I still get a dopamine high when I set up my week on Sunday. It is sooo soothing to see the week in nice little boxes. But then I discovered \"life logging\" and I turned a good thing into a weapon. A blogger I Love, \"The Unconventional Route,\" started recording everything he does throughout the day to get a clearer picture of how he spends his time. So if he scrolled mindlessly on his phone for 3 hours, he'd log that. It's great to start holding yourself accountable. You can't change what you can't measure or whatever the saying is. But I turned this idea into a food diary. I have been writing down everything I eat for the past few years. It's not a calorie tracker. But it might as well be. I write down what I do too (though not to the same granular level that he does, I do not write down when I lose hours scrolling because I don't want to see myself THAT clearly). I have journaled my whole life but I realize that I have been doing it all wrong. I don't tap into my feelings, I simply log what I did that day. I always think it's a good idea to read old journal entries and it NEVER is. Instead of gaining insight into my previous mindset, all I am left with is, \"I slept over at Julia's house, then I went to swim practice.\" Who the fuck cares? What did I talk about at the sleepover, what was on my mind? No clue. And I'm still doing this same unhelpful practice to this day. This is why I feel that I am not a writer and will never be a writer because I am still too afraid to actually form opinions and reflections. I am simply a court stenographer. I transcribe events. No more, no less. And who wants to read that? Nobody. Not even me. OOF so that was a tangent from clothing but it clearly needed to come out. I struggle with self worth and all the self help books have not \"fixed\" me. This brings me back to more golden nuggets from \"Drinking Games.\" - **It's an inside job. There is no quick fix solution.** Everyday you have to make the decision to act how you want to feel. I heard this in a meeting a week ago: \"mood follows action.\" BOOM. After the meeting, I went to Albertsons and immediately consumed a ton of junk food and I felt...bad? I heard her say mood follows action but I still didn't do the right action. How does one do it??? \"Whenever I bought a new beauty product or supplement, I got high on the same strain of hope. This, I always thought, would finally fix me. This moisturizer changed my life, every online review read, and I believed it every time.\" \"I wanted a body that was lean, long, thin, fit, active, strong, fast, tight, tucked, and skin that was plump, glowing, bouncy, dewy, and hydrated. Like my drinking, it was all too much and never enough. I was bottoming out on wellness, I realized. But I wasn't sure I was ready to walk away from it. Wellness had been a pleasant distraction and safe catch-all for my feelings for the better part of a decade. Whenever I felt angry, hurt, or sad, I focused on my weight instead of digging into the root of my feelings. I had wrapped my identity around drinking and changing my body, and I wondered what would be left of me if I unraveled this thread too.\" Hmmmm....interesting. So maybe my obsession with my weight is a distraction and a refusal to acknowledge my feelings? OOF this feels to raw and tender to investigate. I love/hate realizing things when I write. That feels like such a stupid realization but honestly I have never put that together. My obsession with food is a distraction from my feelings. Huh. I mean, I know the reason I binge eat is to numb so I don't know why this jump feels enlightening but it does. Because I don't binge eat every day. So I only feel truly awful when I do but I'm realizing that even though I don't binge eat daily, I still feel terrible daily because I am obsessed with tracking my food and feeling like I \"should\" be eating \"better/cleaner.\" HMMM. Maybe I should stop tracking my food??? THIS FEELS VERY SCARY. BUT MY CONTROL. What control though?? Gah. \"I also began to think critically about my relationship with wellness and alcohol. My quest for nirvana through wellness had not been unlike my pursuit of drunkenness. I thought of both as elixirs that could fix me quickly, and with little real work on my part. I would have bought anything the wellness industry told me would make me glow, strut, and sleep better. Similarly, alcohol touted a promise of ease, relaxation, and confidence. Both worlds promoted the idea of balance (Drink responsibly!) while shirking any real responsibility for outcomes (Consult a doctor before beginning a new fitness regimen!). There's no time for consultations or responsible consumption when you're trying to change everything about yourself.\" - **Wellness is really just another synonym for diet!** What! Yeah drinking juices and obsessing over \"whole foods\" and such is really just another diet. I know it's supposed to be about \"lifestyle\" but really it's just a cover up for diet. \"I heard people in my recovery meetings say that hitting bottom doesn't have to be catastrophic; it can simply mean that we are ready to stop digging. I was ready to stop living in my wellness hole. But this meant admitting something I had never said out loud before: in my world, wellness had just been a fancy word for diet. Underneath the gloss of new products and promises, all I had ever wanted was to be small, and look like all the other girls.\" This all reminds me of Caroline Knapp's (the OG quit lit author) book, \"Appetites.\" She details how all women have a vacuous hole that they seek to fill with one of three things: food, clothes and men. It feel insultingly reductive but it is ON THE NOSE. \"My clean clothes and streamlined wardrobe helped me signal that I was more confident in my identity when I stopped drinking. But getting dressed was just one way I learned to care for myself in sobriety. My mornings were another, a quiet stretch of time with coffee and my journal before starting the workday. Daily walks with no destination were also a favorite, just me and a good podcast or playlist. For other people, self-care might look like cooking more meals at home, joining a softball team, or painting. It doesn't matter, really. It all comes back to the same place: recognizing that, now, you have a choice in how you spend your time and present yourself. Without alcohol, I had the space to figure out who I was and how I wanted to walk through my life. The chic boots I wore along the way were just a bonus.\""
    },
    {
      "id": "111",
      "title": "Easy Crafts for the Insane: A Mostly Funny Memoir of Mental Illness and Making Things",
      "author": "Kelly Williams Brown",
      "myRating": 4,
      "averageRating": 3.8,
      "yearPublished": 2022,
      "dateRead": "2023-02-11",
      "review": "She is so delightful and her writing is engaging, even about really heavy topics. I appreciate her honesty and vulnerability."
    },
    {
      "id": "117",
      "title": "Luckiest Girl Alive",
      "author": "Jessica Knoll",
      "myRating": 4,
      "averageRating": 3.54,
      "yearPublished": 2015,
      "dateRead": "2023-01-25",
      "review": "At first this read like a book I would have loved in middle school/high school (gossip girl or the clique) but then the shooting happened. Woah I did not see that coming. It was very hard to read given all of the school shootings and mass violence we see every day on the news. I am pleased with the ending. I was hooked and needed to tear through every chapter."
    },
    {
      "id": "118",
      "title": "Call of the Mild: Learning to Hunt My Own Dinner",
      "author": "Lily Raff McCaulou",
      "myRating": 4,
      "averageRating": 4.12,
      "yearPublished": 2012,
      "dateRead": "2023-01-22",
      "review": "I enjoyed this book. Mostly because it's based in Bend but also because it offers a different take on hunting. My brother and dad are lifelong hunters but I've never understood the appeal. The author highlights a lot of uncomfortable truths about the meat we consume. Her writing is engaging and personal despite being full of stats that I ordinarily wouldn't have been interested in. This made me want to be a journalist. Interesting how hunting is almost meditative to her, she's not zoned out or anxious. Reminded me that I want to learn more about my environment."
    },
    {
      "id": "119",
      "title": "Razorblade Tears",
      "author": "S.A. Cosby",
      "myRating": 3,
      "averageRating": 4.12,
      "yearPublished": 2021,
      "dateRead": "2023-01-19",
      "review": "Hmm. I'm in the minority I guess. Did not work for me. Gratuitous violence in the name of characters we never got to know/had no attachment to. When we find out who the leads are looking for, I was unmoved. The way the \"puzzle pieces came together\" did not do it for me. The ending was way too neat. I don't see many redeeming qualities about this story."
    },
    {
      "id": "120",
      "title": "Good for a Girl: A Woman Running in a Man's World",
      "author": "Lauren Fleshman",
      "myRating": 5,
      "averageRating": 4.46,
      "yearPublished": 2023,
      "dateRead": "2023-01-13",
      "review": "Amazon randomly pushed the book \"Radically Content\" by Jamie Varon on my Kindle so I downloaded it from the library and I LOVED IT. I wanted to devour all the Jamie Varon content I could find so I listened to a bunch of podcasts where she was a guest. This is how I discovered Nicole Antoinette and her podcasts (Real Talk Radio & The Pop Up Pod), which are both amazing. After my Jamie Varon rabbit hole, I fell into a Nicole Antoinette rabbit hole. Lauren Fleshman is a guest on Nicole's podcast and I really enjoyed her episodes. I discovered that Nicole used to live in Bend and Lauren currently does! Which is so fun because I had just moved to Bend. I tried to read more of Lauren Fleshman's writing by going to her blog ([asklaurenfleshman.com](http://asklaurenfleshman.com/)) but sadly, it looks like they took it down and replaced it with a website promoting this book. I find this very irritating because I want to read more of Lauren's writing!! (I messaged her on Twitter about this and she did not respond lol) I read her book because I liked her perspective on Nicole's podcast. I read and appreciated her opinion piece for the NYT \"I Changed My Body for My Sport. No Girl Should.\" I also read Mary Cain's piece, \"I Was the Fastest Girl in America, Until I Joined Nike,\" which was equally eye opening and disheartening. I am the target audience of \"Good for a Girl.\" It didn't hurt that she was going to be speaking at my local bookstore later this month. So I ordered a pre-order copy (which she signed). I am a Kindle girl. Kendall the Kindle girl. I will force anyone who will listen to buy a kindle. So this was interesting because I can't even remember the last time I read a physical book. Honestly, it made me miss my Kindle. Hardcovers are so bulky! Okay enough preamble...oh I remember why I wrote this because now to remember the quotes I loved (which I had to use a physical highlighter for!), I need to go fetch my physical copy and dig them up. I should also mention that I am distance runner. I run recreationally and really struggle to even identify myself as a \"runner\" because I am not skinny and I did not run track or cross country in high school. I don't know why I have decided that those are the only qualifiers to be a runner. I have done 3 marathons, 3 half marathons and 2 triathlons (sprint distance, I always must discount things that I should be proud of...I have issues). I am running a marathon in April and my goal is to qualify for Boston (the route is not a Boston qualifying race but I need a goal to work toward!) Yet I still refuse to call myself a runner. So it was really nice to read that even Lauren Fleshman, the definition of a RUNNER, struggles with feeling worthy/deserving certain titles as well. I know I am the target audience but I wish more people would read this book besides people like me. I wish my husband would read this book but I know he won't! UGH. Here are some golden nuggets: (I marked this review as having spoilers because of my highlights although I don't think any of these really spoil the book at all) - \"Women made great men possible. What made great women possible? Avoiding the vortex of a man's ambition? Being alone?\" (page 73) - [Referring to the Stanford mens team] \"They were focused on battling the competition. We spent so much of our competitive energy battling ourselves.\" (page 84) - \"In obsessing about the scale and how I looked, I was outsourcing my confidence.\" (page 105) - \"One definition of privilege is who gets to make mistakes.\" (page 115) - \"If there had been intentional space made in sports for menstrual health and symptom management by coaches and staff, I would have viewed my cycle as something to learn from and work with, instead of as a limiting inconvenience that made me resent my female body.\" (page 118) *!!! This. I resent my female body ALL THE TIME.* - \"She listened, and I found that allowing her to be a witness to my worries defused them, whereas trying not to think about them made them louder.\" (page 144) - Making everything about winning, about the Olympics, about being the best..it felt BAD. Not just when things went wrong, but most of the time, The industry's emphasis on outcomes placed no value on the things that made me fall in love with running in the first place...the simple pleasure of mastering a skill...any pursuit of excellence had to center these moments of joy, or it wasn't worth doing.\" (page 196) - \"Having clarity around who you are, what you stand for, and how you want to be understood is not egotistical. It's a chance to take stock of things and be intentional. It's going to be good for life, too, not just in sports. Let's get to the core of who you are and what you want.\" - \"I want to tell a sports story in a different, more human, more honest way, in real time, and not wait for someone else to tell it. I want to tell it as I go, and not wait to see if I'm ‚Äòsuccessful' or not, because I want to expand the definition of success beyond traditional outcomes.\" (page 197) !!! - Those were things i could do that didn't depend on my physical body being 100% perfect all the time. I could always tell stories and build communities. Maybe they would give people a story to follow, making the highs more exciting. Maybe they would make the lows a little less lonely and painful for me when they happened. And maybe storytelling and community building would make the transition out of sports easier one day.\" (page 197) - \"But I found that the more honest I was, the more readers engaged positively, too. My blog gave me something to look forward to every day that wasn't running.\" (page 203) - \"How interesting that a visual cue like these race buns could hijack the mind so easily. These little briefs that only women were expected to wear were essentially designed for that purpose, to make female athletes objects of displace. Feminine uniforms were created to assuage fears that sport and femininity were at odds, and as an entertaining consolation for audiences for watching ‚Äòinferior performances' Uniform guidelines mandating exposed skin and ‚Äòformfitting' silhouettes for only one gender must have been coded into rule books across many sports. in others, they have been internalized as symbols of professionalism by the women themselves—the high heels of the running world—but instead of back pain, you get body dysmorphia.\" (page 206) *GUT PUNCH.* - \"I didn't have these athletic role models yet, but I was trying in my own way, to be one. When I broke my navicular and narrowly missed the Olympics, and was unsure if I'd return to what I loved, I looked for guidance everywhere online. What do you do when things fall apart? How do you continue trying when the likelihood of success is so slim? How do you make yourself vulnerable after heartache? I found these stories in literature, in the lives of fictional characters, but I couldn't find these real-time stories in sports. Athletes weren't telling them. They weren't talking unless they were winning, reflecting back on rough times long gone. I needed the material that would help me take one more step forward without the promise of a happy ending. So I wrote it myself. (page 211) *MIC DROP.* - \"...I wanted to provide at least one person's accurate representation of chasing big goals for the next person who searched the internet during a low point...The more my life expanded off the track, the more satisfied I was on it.\" (page 211) - \"Four years ago, I bought into the idea that all that mattered was the Olympics. I lived like the running monk everyone told me to be, and it killed the joy of everything. Since then, I've defined success for myself and I do it my own way. I reject the idea that all that matters is becoming an Olympian.\" (page 218) - \"This isn't the ending I dreamed of, sure. But when you realized failing doesn't make you a failure, you give yourself permission to try all sorts of things.\" (page 218) *!!! Big star next to the highlight!!* - \"Because I hate that I felt good about it until everyone else showed up. I hate giving that power to anyone. I've spent so much time wiring about how it's all about the journey or whatever, and now I feel full of shit. ‚ÄòIt's easy to say it's all about the journey when you're winning.'\" (page 219) - \"It was yet another reminder that people are hungry for the truth, and that the truth spurs liberation.\" (page 238) - \"My priority was getting my athletes to stop outsourcing their key decision-making, to trust themselves, to take the wheel and drive their running and their lives.\" (page 247) - \"I was able to hear these messages we tell ourselves for what they are: violence.\" (page 249) - \"Every woman who lost confidence and self-worth for ‚Äòfailing' to progress. Every woman who couldn't eat without having ‚Äòearned it' and turned to exercise as punishment to atone for indulgence. (page 250) *Me*... - \"I had felt angry with the women who developed eating disorders or made choices that hurt their health or our teams' prospects. Now I was angry that so many women and girls were blamed for not thriving in a system not truly built for them.\" (page 250) - \"We need adults to deal with their own issues around food and body so they don't pas them on to the children and young adults in their care. (page 258) *Hi mom!* - \"We need passionate leaders of all genders to take women's sports into the next fifty years and beyond. But we also need stories. A flood of them. the invisible and the forbidden. The small stuff that adds up to big change.\" (page 258) - \"While it had taken me some time to realized it or call it by its name, my whole life I had been engaging in the hard work of learning to run for myself, not for others. I had been learning how to return to myself, again and again, in a world full of forces that consistently pull us away. I wanted to hold tight to that knowledge; even more strongly, I wanted to pass it on.\" (page 260) Omg typing all of those quotes up was exhausting. So grateful for my Kindle that I never have to do this again lol. I don't usually share my highlights publicly on Goodreads but this analog method left me no choice. I don't have the energy to reflect on all of my favorite quotes right now. Perhaps I will return to this review and update it. Because I have a lot of thoughts. Basically I echo everything Lauren says. The world is unfair. Being a woman has a lot of drawbacks, but the world needs to start changing to accommodate the fact that men and women are different!! Lauren mentions the book \"Invisible Women\" by Caroline Criado P√©rez, which I couldn't finish because It was just SO DAMN DEPRESSING. Nothing in this world is set up with women in mind. Nothing is set up for our bodies. We are second class citizens and it makes me want to SET MYSELF ON FIRE."
    },
    {
      "id": "121",
      "title": "Local Woman Missing",
      "author": "Mary Kubica",
      "myRating": 3,
      "averageRating": 4.12,
      "yearPublished": 2021,
      "dateRead": "2023-01-12",
      "review": "Hmm...too many coincidences (two missing girls that look almost identical and are the same age?) and Meredith was too dumb to believe. And why wouldn't B just kill Delilah? Why even keep her alive? I feel unfulfilled."
    },
    {
      "id": "122",
      "title": "A Good Marriage",
      "author": "Kimberly McCreight",
      "myRating": 4,
      "averageRating": 3.9,
      "yearPublished": 2020,
      "dateRead": "2022-12-29",
      "review": "Last night I finished the book, \"A Good Marriage.\" For most of the book, I was rapt. The writing was smart and fast (to me, many GoodReads reviews said it was a slow build). But I found the ending dissatisfying. I read this book because of a recently discovered podcast, \"Pop Fiction Women.\" Earlier this month, I watched an episode of \"Fleishman Is In Trouble\" titled \"This Is My Enjoyment\" (episode 6 of the mini-series based on a book I really enjoyed) and felt like I HAD to discuss it with someone. The episode made me feel seen because it centers on someone struggling with the transition to middle age and clinging to who she used to be and who she wanted to be. She is disillusioned with who she had become. I searched Spotify for discussions on the tv show/book and stumbled upon this podcast. I learned that the two hosts are old law school friends who live in New York and love to read. They also love Sally Rooney and Fleabag, so I figured I could trust their taste. I was so happy because I have been struggling to find book inspiration. I have loathed books from Reese's Book Club. I read Goodreads reviews of books that I enjoyed then I stalk the reading lists of the reviewers that I agree with. This works 60% of the time but I wanted to up my odds. My issue with \"A Good Marriage\" is that there are so many loose ends that were not resolved!! Also I thought the ending was sloppy. 1. The reveal of killer/the twist. Kerry was such a minor part of the book but he decides that instead of going to the sex party with his wife, he would instead play basketball but then attend the party on a whim and harass Amanda via text. - Then the author is super murky on what actually lead to her death in his written confession. He has a ski mask in his gym bag and decides to attack her to scare her and then his plan was to console her? How would this have panned out?? How do you attack someone then switch into the savior? Would he have left and then ditched the mask and returned? I don't get it. - He also states that he and Amanda had a relationship which is never touched on in the book. Is it a lie? Or did the author just not include the reader in on this part? We see Amanda's perspective and in no way do they seem to have a relationship. - The ending was just so rushed and non sensical. Kerry is an ex partner at Lizzie's new firm and he was fired before she started? Because he stalked women and said \"if you'd just listen to me\"? And he supposedly had pornographic photos of these women? And worked with them? And then his wife finds out about his porn addiction from the cyber attacks that are orchestrated by Zach on their school? I just didn't follow his backstory. 2. Amanda's mental health. So if her father and best friend, Carolyn, are both dead, who is she spending time with when she is with them? Was someone really stalking her or was that just in her head? All those times when she was hanging out with or running with Carolyn, was she talking to herself? And no one ever noticed it? She only imagined people when she was alone and no one ever saw her? They never explained her mental state. 3. What was the deal with Amanda's uncle? Was he just a red herring? So many unanswered questions. I just listened to the podcast episode where they interview the author and one of the hosts, Carinn, says the book is very satisfying in the end. I could not disagree more. This is one of the most unsatisfying books I have read in a while. Lots of books end ambiguously and bother me. What bothers me more is that this one pretended that it answered all of the open questions but it most certainly did not. I need a book club where everyone loves and hates the same books as me. I tried to discuss my frustration with my husband and he gave no shits. \"You know when you are engrossed in a thriller and then it leaves a lot of things unanswered?\" \"Yeah.\" \"This woman thought she was being stalked by her dead father and regularly hung out with her dead best friend.\" \"Uh huh.\" He told me I need to join a book club. But then I told him that I hate most \"book club\" books (like Reese's). I am going to join a book club that is starting next month but he told me I probably shouldn't join it because I am overly critical and I will end up losing friends. He's not wrong. I know some people on Goodreads share my sentiments but I need to discuss with people in person. I know I should not want people who share the exact same opinion as me but I want to love something and for others to share that love (and hate something and feel validated). End of rant."
    },
    {
      "id": "123",
      "title": "Mother Daughter Widow Wife",
      "author": "Robin Wasserman",
      "myRating": 3,
      "averageRating": 3.18,
      "yearPublished": 2020,
      "dateRead": "2022-12-25",
      "review": "Engaging in the beginning but then I completely lost interest. Only finished to hit 50 books."
    },
    {
      "id": "124",
      "title": "The Boys' Club",
      "author": "Erica Katz",
      "myRating": 3,
      "averageRating": 3.92,
      "yearPublished": 2020,
      "dateRead": "2022-12-22",
      "review": "Mindless. Entertaining enough I suppose. Very similar to \"devil wears Prada.\""
    },
    {
      "id": "125",
      "title": "Privilege",
      "author": "Mary Adkins",
      "myRating": 4,
      "averageRating": 3.61,
      "yearPublished": 2020,
      "dateRead": "2022-12-19",
      "review": null
    },
    {
      "id": "84",
      "title": "Tell Me Everything: The Story of a Private Investigation",
      "author": "Erika Krouse",
      "myRating": 5,
      "averageRating": 3.76,
      "yearPublished": 2022,
      "dateRead": "2022-12-11",
      "review": "Heavy stuff. Had me weeping. Reminded me of \"know my name.\" Made me hate football even more than I already did. My husband is a big dolphins fan and when I heard about what happened to Tua I was appalled. Then we got into a fight about CTE because \"these players know what they are signed up for. Are you saying these players shouldn't play football for a chance to bring their families out of poverty?\" At a cost of their brain? Yes, that is what I'm saying.. \"Some players spoke with no affect at all, like low-voiced robots. Some players erupted in fury when they heard a question they didn't like, and then seemed to forget their rage immediately, friendly again. Most of the players I spoke with seemed confused. At that time, the Journal of the American Medical Association had not yet conducted their 2017 study of the brains of 202 deceased football players. They studied people who had played football in high school, college, and the NFL. They diagnosed chronic traumatic encephalopathy (CTE), a degenerative brain disorder, in 21 percent of high school players and 91 percent of college football players. Among the 111 NFL players they studied, 110 had the disease, bringing the statistic up to over 99 percent. The longer you play, the worse the symptoms, which include aggression, ADHD, cognitive impairment, impulsive behavior, apathy, confusion, disorientation, dizziness, vertigo, headaches, social/emotional instability, personality changes, sensory processing disorder, speech impediments, balance issues, deafness, erratic/inappropriate/explosive behavior, pathological jealousy, paranoia, depression, progressive dementia, memory loss, amnesia, strokes, and suicidal ideation. Football players' chances of contracting dementia at any age were between 33 and 85 percent. But I didn't know any of this back then. I only knew what Calliope had told me: \"These guys get hit in the head a lot. A lot. They don't always even understand what they're saying or doing. And then they forget immediately, like their brain is quicksand.\" I wondered what it was like to forget everything-everything bad that had ever happened to you, everything bad you ever did or watched someone else do. One player spent our conversation repeating that everything was \"clean, aboveboard. Just a sports team at a party.\" After I gave up and said goodbye, he called me back a few moments later and said earnestly, \"Erika, I just want you to know something. I've met hundreds of people in college programs. The stuff that happens here, well, that happens everywhere. Everywhere. It's just the general culture of recruiting trips.\" — Tried to comment the following on the 1 star review of \"JanB\" but we aren't friends so I can't: I honestly thought your profile was fake and made to discredit the book but it seems as though you are a real person. I've never wanted to fight with someone in the comments on goodreads before. So surprised at all these comments! \"While I have the utmost sympathy for anyone who endures abuse, I just can't read about it anymore.\" What drew you to the book in the first place?"
    },
    {
      "id": "87",
      "title": "The Long Answer",
      "author": "Anna Hogeland",
      "myRating": 4,
      "averageRating": 3.83,
      "yearPublished": 2022,
      "dateRead": "2022-11-23",
      "review": "I am deeply afraid of motherhood so all I read now are books about motherhood."
    },
    {
      "id": "85",
      "title": "The Rules Do Not Apply",
      "author": "Ariel Levy",
      "myRating": 5,
      "averageRating": 3.7,
      "yearPublished": 2017,
      "dateRead": "2022-11-22",
      "review": "I love her writing."
    },
    {
      "id": "68",
      "title": "Body Work: The Radical Power of Personal Narrative",
      "author": "Melissa Febos",
      "myRating": 5,
      "averageRating": 4.22,
      "yearPublished": 2022,
      "dateRead": "2022-11-20",
      "review": "The first chapter of the book, \"In Defense of Navel Gazing,\" hit the nail on the head for me. She tackles the persistent voice full of fear which says \"Who cares?\" I hear this voice every time I sit down to write. Instead of writing for me, I get lost writing for \"them.\" These other people who will criticize my words and deem them unnecessary and trite. Melissa questions herself, \"who are these other people?\" and realizes that they are the people who have dismissed her or made her feel small and notes that these are the exact people that she does not write for. She does not value their opinion. She does not wish to associate with these people. So why does she let their opinion dictate the value of her writing? She explains that writing is a way of healing and learning from herself. It is a form of processing. This has always been true for me. Until I write something down, it sloshes around in my head and controls me. This is not to say that I am free of my thoughts as soon as I get them on the page, but they do lose a bit of their sting. This is why I am obsessive about bullet journaling. I write down what I do, what I eat, at what time. I feel lost if I get behind in my daily log. I feel anxious. It's like I am alone with my thoughts and trapped with them until I can get them \"out.\" Then I can feel a bit of distance, a bit of breathing room. I struggle with the next step of learning from my thoughts. I am lacking in the analysis/reflection step. I can word vomit but then I can't look at what the vomit is telling me (gross). And if you can't learn what you ate that made you throw up, how will you ever get better? Ugh. See this is a learning process right now. I struggle to face my emotions. I can write them down but I can't process them. It feels too vulnerable and exposed. It feels like poking a wound. I must cover the wound and never address it. But then it never heals. It festers. It gets infected. It infects other parts of me. It inflames my immune system. I feel so fatigued. I feel so weighed down. I am so tired of feeling this way. How can I feel lighter? Am I just a narcissist? Am I that person they are referring to in the movie Easy A when they say \"I don't know what your generation's fascination is with documenting your every thought... but I can assure you, they're not all diamonds. \"Roman is having an OK day, and bought a Coke Zero at the gas station. Raise the roof.\" Who gives a rat's ass?\" Aka am I a navel gazer who overshares but doesn't share anything of substance. Would anyone even want to read my blog or listen to my podcast!? Am I an asshole for thinking I am that interesting when I have accomplished exactly nothing in my life thus far!? Melissa Febos essentially busts this line of thinking but I can't help the way my toxic brain works against me! But in her TedTalk \"Telling Your Secrets Can Set You Free\" she says \"transforming your personal experience into literary art is a process of creation. you don't just get to transcribe the events in the order that they happened. you describe the events and then you have to look at them you have to meet the gaze of your past self and ask her the questions that sometimes we spend our whole lives avoiding asking and then you have to listen to her answers\""
    },
    {
      "id": "109",
      "title": "Acne",
      "author": "Laura Chinn",
      "myRating": 4,
      "averageRating": 4.28,
      "yearPublished": 2022,
      "dateRead": "2022-11-15",
      "review": "Laura Chinn has had the absolute saddest life. So much terrible parenting. So much loss. I enjoyed this memoir despite the hardships because Laura is relentlessly focused on healing."
    },
    {
      "id": "126",
      "title": "Now I See You: A Memoir",
      "author": "Nicole C. Kear",
      "myRating": 2,
      "averageRating": 3.8,
      "yearPublished": 2014,
      "dateRead": "2022-11-15",
      "review": "I thought this would be more about the internal strength it requires to face a harrowing illness but it was more of a mommy blog post full of denial."
    },
    {
      "id": "106",
      "title": "What My Bones Know",
      "author": "Stephanie Foo",
      "myRating": 5,
      "averageRating": 4.5,
      "yearPublished": 2022,
      "dateRead": "2022-11-09",
      "review": "Fantastic. Beautifully written. As someone who does not have CPTSD, but has a lot of self loathing and is hyper vigilant, I found this memoir to be so inspirational and real. --- I feel like ever since I got a smartphone, I am no longer capable of critical thinking and reflection. I am constantly consuming content but I never pause to reflect. Even when I read books, I rate them on Goodreads and then immediately move on. I started trying to write little blurbs about what I liked or disliked about the book recently and that has helped. But then I see these prolific writers on Goodreads who take the time to write essays on books they read and I think \"HOW?\" How do these people have so much insight to share? I am simply writing things like \"I loved this book. Made me cry.\" or \"I hated this book. Annoying narrator.\" Am I a child? Have I reverted? I used to have to write book reports and actually reflect on the material. I feel like even though I just read an amazing book, I don't even know if I have any articulate thoughts to say about it. I feel like I have been programmed to look for shortcuts. It's all about quantity and not about quality. I don't ponder or reflect. I consume and move on, consume and move on. But I don't absorb anything. \"What My Bones Know\" by Stephanie Foo is an incredible memoir. She grew up in San Jose to physically and verbally abusive parents who are ethnically Chinese but immigrated from Malaysia. Foo is adept at recognizing that \"hurt people hurt people\" and fights very hard to protect her parents and often rationalizes their behavior. It made me realize how fragile our sense of self can be and how susceptible children are to our parents' words and actions. I related to everything she said and then felt guilty because I had a loving and supportive childhood - so what is my excuse for being maladapted to society? Where did my hypervigilant inner monologue come from? It's clear to see where Foo's came from. She was constantly told that she was the source of her parents' pain and she internalized this belief as a concrete fact about her character. Another Goodreads account that I follow, Thomas, pointed out how impressive Foo's commitment to healing was, even when she felt like she wasn't making progress. She is incredibly introspective and reflective. She doesn't give up. She truly wants to do the work to better understand herself and change. I also grew up in the Bay Area, a place where there is definitely a lot of pressure on kids to achieve and perform well in school. I am from the East Bay, which has different culture dynamics than San Jose (aka it is way more white). I am also not a child of immigrant parents. Although a good chunk of my schools were made up of Asians, it was mostly white. I 100% fell for the stereotypical oversimplification of viewing (all) Asians as the model minority. I remember hearing that UCLA stood for \"University of Caucasions Lost among Asians\" and thinking it was funny. I went to Berkeley and felt like I was losing a competition constantly to Asians who \"ruined the curve.\" This book gave me a layer of empathy that I was previously lacking. I was like her white high school teacher who just assumed that Asians were perfectionists that were stressed about getting a bad grade. I learned that is such a one dimensional way of looking at things. You truly have no idea what is going on in someone else's household and you can't understand the dynamics and motivations of others just by looking at them from the outside. It was heartbreaking when she went back to her old high school and connected with the school's social worker (a position that did not exist when she was in school). Hearing that some kids develop coke additions, not because they are spoiled kids that party too much, but so that they can stay awake for unhealthy periods of time working on school work or extracurricular activities. Truly heartbreaking. We are in the middle of a mental health crisis and our youth are taking the brunt of the attack. It made me want to become a mental health advocate for children (something I have looked into on a cursory level before - but CASA, Court Appointed Special Advocate, in San Diego rejected me because they didn't think I'd stay in San Diego long term, and they weren't wrong but I would have if I had been chosen! Anyway, I digress...) Foo did such an excellent job at weaving in scientific studies with her own personal thoughts and experiences. This book made me think about all the trauma that is passed down from person to person through our bodies. I have been meaning to read \"The Body Keeps Score\" for some time but have never gotten around to it. Before this book, I believed conceptually that physical trauma can be passed down generationally. But hearing the study about mice who reacted adversely to cherry blossoms even though they had never smelled them before and learning their parents were shocked when they smelled cherry blossoms really solidified my understanding. Parts made me feel despondent because there is so much pain and suffering in this world. How can we ever begin to heal? Foo had to work tirelessly for years before she saw any improvement. I love memoirs because I am always interested in \"pulling back the curtain\" and learning about raw experiences. She was open about using hostility in high school as a protective mechanism, an experience that I relate to today. I loved the parts of the audiobook where she included direct clips from her therapy sessions. Foo is a beautiful storyteller and truth teller. She made me feel seen and less alone. Her story is authentic, painful, and uplifting all at the same time. I highly recommend this book."
    },
    {
      "id": "81",
      "title": "Stay True",
      "author": "Hua Hsu",
      "myRating": 2,
      "averageRating": 3.99,
      "yearPublished": 2022,
      "dateRead": "2022-11-06",
      "review": "Originally DNF 51% but decided to finish. Not worth it. Written by a pretentious Cal poli sci major...boring and not moving or profound at all."
    },
    {
      "id": "127",
      "title": "Mother in the Dark",
      "author": "Kayla Maiuri",
      "myRating": 1,
      "averageRating": 3.79,
      "yearPublished": 2022,
      "dateRead": "2022-11-05",
      "review": "I despised this book."
    },
    {
      "id": "80",
      "title": "My Body",
      "author": "Emily Ratajkowski",
      "myRating": 5,
      "averageRating": 3.98,
      "yearPublished": 2021,
      "dateRead": "2022-10-31",
      "review": "I hated her and thought she was part of the problem but now I feel like I know her and respect her more. I found this quote from an article about Taylor swift using the word \"fat\" in her music video that I think applies here as well: \"So, is this backlash fair? And is it right for the finger to be pointed at one person who is a symptom of the problematic body image culture we've all found ourselves living in, rather than a conscious contributor to it?\" It's not Emily's fault. She's a symptom of the system. I do agree with reviews that says she never reflects on what her impact is on women, only on how men have made her feel."
    },
    {
      "id": "79",
      "title": "Detransition, Baby",
      "author": "Torrey Peters",
      "myRating": 4,
      "averageRating": 3.92,
      "yearPublished": 2021,
      "dateRead": "2022-10-30",
      "review": "Not sure how to feel. Made me think A LOT. I need to discuss with someone. \"She knew that no matter how you self-identify ultimately, chances are that you succumb to becoming what the world treats you as.\""
    },
    {
      "id": "128",
      "title": "The Way of Integrity: Finding the Path to Your True Self",
      "author": "Martha N. Beck",
      "myRating": 5,
      "averageRating": 4.17,
      "yearPublished": 2021,
      "dateRead": "2022-10-27",
      "review": "YES Martha! This book has so many golden nuggets in it. And it has so many techniques to practice IRL (something that I struggle with when I read self help books because I feel unsure how to apply things in my brain into my daily life). I listened to this on audiobook and I had just written an angry letter to someone I resent (with no plans to send it) and it made me feel 0% better. Then I listened to chapter 7 which asks you to do just that and then explains what a waste of time this is and you should be doing something creative instead - Oprah knows what's good."
    },
    {
      "id": "129",
      "title": "I'm Glad My Mom Died",
      "author": "Jennette McCurdy",
      "myRating": 4,
      "averageRating": 4.44,
      "yearPublished": 2022,
      "dateRead": "2022-10-21",
      "review": "The parts where you can hear her crying. Gutted."
    },
    {
      "id": "130",
      "title": "The Rabbit Hutch",
      "author": "Tess Gunty",
      "myRating": 4,
      "averageRating": 3.51,
      "yearPublished": 2022,
      "dateRead": "2022-10-18",
      "review": "Tense book. Intriguing. Depressing. Capitalism is ruining everything."
    },
    {
      "id": "131",
      "title": "Happy-Go-Lucky",
      "author": "David Sedaris",
      "myRating": 4,
      "averageRating": 4.16,
      "yearPublished": 2022,
      "dateRead": "2022-10-08",
      "review": "I listened to David Sedaris' \"Happy-Go-Lucky\" on audiobook last night. Most of the time I find his essays delightful. This one made me laugh out loud a few times. I audibly gasped when he told a story about a man sticking a glass dildo up his rectum that exploded and my partner came running and asked what happened but I didn't hear him and kept maniacally cackling to myself. After finishing the collection and reading reviews for the book I realized he did do a lot of questionable things during the pandemic (as in he didn't follow any Covid rules), which was definitely a sign of his immense privilege. He also talked at length about how rich and successful he is now, which felt pretty unnecessary. He seemed pretty out of touch when he would go on and on about how much he missed shopping because that's all he and his sister, Amy, do together. I became weary when he discussed his sister, Tiffany's alleged abuse by their father. He essentially said Tiffany (who committed suicide) was an unreliable narrator and you couldn't trust what she said. But then he told various disturbing stories where his dad would take him alone to the bathroom and examine his asshole when David was a child, so this guy definitely seemed like a predator."
    },
    {
      "id": "108",
      "title": "Group: How One Therapist and a Circle of Strangers Saved My Life",
      "author": "Christie Tate",
      "myRating": 4,
      "averageRating": 3.8,
      "yearPublished": 2020,
      "dateRead": "2022-10-05",
      "review": "I found her story interesting but was kind of depressed by how focused it was on finding a man instead of more about loving herself. Is her therapist a genius or a creep? There were a lot of moments where I couldn't tell. I could not deal with the lack of anonymity (it seemed so gossipy) but I guess we are only as sick as our secrets right?"
    },
    {
      "id": "132",
      "title": "Just Last Night",
      "author": "Mhairi McFarlane",
      "myRating": 3,
      "averageRating": 4,
      "yearPublished": 2021,
      "dateRead": "2022-09-21",
      "review": null
    },
    {
      "id": "133",
      "title": "All Together Now",
      "author": "Matthew Norman",
      "myRating": 3,
      "averageRating": 3.98,
      "yearPublished": 2021,
      "dateRead": "2022-09-19",
      "review": "I needed a beach read."
    },
    {
      "id": "107",
      "title": "I'll Show Myself Out: Essays on Midlife and Motherhood",
      "author": "Jessi Klein",
      "myRating": 4,
      "averageRating": 3.89,
      "yearPublished": 2022,
      "dateRead": "2022-09-13",
      "review": "Sure she's privileged but she's also quite funny and I enjoy her essays."
    },
    {
      "id": "114",
      "title": "Radically Content: Being Satisfied in an Endlessly Dissatisfied World",
      "author": "Jamie Varon",
      "myRating": 5,
      "averageRating": 3.62,
      "yearPublished": 2022,
      "dateRead": "2022-09-01",
      "review": "This is a magical book. It spoke to my soul. I have to take some time to reflect on all its wisdom."
    },
    {
      "id": "134",
      "title": "Let's Take the Long Way Home: A Memoir of Friendship",
      "author": "Gail Caldwell",
      "myRating": 4,
      "averageRating": 3.96,
      "yearPublished": 2010,
      "dateRead": "2022-08-22",
      "review": "I wasn't sad when Caroline died (probably because I knew it was coming) but I SOBBED when clementine was attacked. Ugh. My heart. Beautiful story about deep female friendship."
    },
    {
      "id": "135",
      "title": "There Are No Grown-ups: A Midlife Coming-of-Age Story",
      "author": "Pamela Druckerman",
      "myRating": 4,
      "averageRating": 3.31,
      "yearPublished": 2018,
      "dateRead": "2022-08-09",
      "review": "Delightful. Like a Gretchen Rubin book but more fun."
    },
    {
      "id": "136",
      "title": "Disorientation",
      "author": "Elaine Hsieh Chou",
      "myRating": 4,
      "averageRating": 3.82,
      "yearPublished": 2022,
      "dateRead": "2022-08-04",
      "review": "Unsure of how to write a review of this book"
    },
    {
      "id": "137",
      "title": "Get Off Your \"But\": How to End Self-Sabotage and Stand Up for Yourself",
      "author": "Sean Stephenson",
      "myRating": 5,
      "averageRating": 3.95,
      "yearPublished": 2009,
      "dateRead": "2022-07-27",
      "review": "Loved this book. I was sad to learn that the author passed away in 2019. Some golden nuggets: \"Stop blaming your boss, family, neighbor, lover, government, society, or God. You are the one at the scene of the crime every time something goes wrong in your life. Stop looking for a fall guy, a scapegoat, or an innocent bystander to pin your problems on. Until you take ownership for your life, you will always be chasing happiness.\" \"Simply put, I love everyone so that no one can own me. If I hate another person, she owns me. It's true. Watch what happens in your life when you don't like someone: ‚Ä¢ He owns your very thoughts, every time you think about how awful he is. ‚Ä¢ He owns the conversations you have when you complain about him to your friends. ‚Ä¢ He even owns your behavior, when you change your plans to avoid him. ¬† When we hate someone, we become her little marionette. She can make us bob up and down, side to side, in any direction she chooses—that is, until we finally stop hating her and move on. Not being controlled by another person is not the only reason for loving everyone, but it is certainly a very important motivator.\" - I hold grudges for a long time even though I know the saying - Keeping resentments is like \"swallowing poison and expecting the other person to die.\" I especially loved \"Lesson 2: Watch What You Say to Yourself.\" - Lots to unpack here. I am very mean to myself and have a really hard time saying nice things to myself. \"Fairness is an illusion. Fairness never existed and never will. No one in life gets less or more than anyone else. We just get different stuff. ¬† That's right. No one is dealt a bad or a good hand in life; we're just dealt cards. It's up to us to stay in the game and play. Sure, some cards look \"better,\" but they're really not. If you look closely, you'll see that anything you feel has been taken from you—or never given to you at all—was replaced with other amazing opportunities and gifts. It's up to you to find them.\" - So much yes. I am constantly playing the \"fairness police\" and it is such a waste of time. From Lesson 5: Choose Your Friends Wisely: \"Just as a goldfish swimming in a tank of diseased water inevitably becomes sick, a human hanging out in a toxic peer group eventually becomes toxic. When you place yourself in an environment, you eventually become the environment. It's inevitable.\" \"It's up to you to apply the lessons and do the activities. If you just read this book passively, prepare for passive results.\" - Me with every self help book I've ever read..."
    },
    {
      "id": "138",
      "title": "Nowhere for Very Long",
      "author": "Brianna Madia",
      "myRating": 3,
      "averageRating": 4.09,
      "yearPublished": 2022,
      "dateRead": "2022-07-26",
      "review": "I like reading about unconventional paths. When I realized she was an influencer I became less intrigued. Not a deep book but an easy read that makes you want to quit your job and go live in a van in Utah (something I'm seriously considering...)"
    },
    {
      "id": "139",
      "title": "Joan Is Okay",
      "author": "Weike Wang",
      "myRating": 3,
      "averageRating": 3.66,
      "yearPublished": 2022,
      "dateRead": "2022-07-21",
      "review": null
    },
    {
      "id": "140",
      "title": "Animal",
      "author": "Lisa Taddeo",
      "myRating": 4,
      "averageRating": 3.7,
      "yearPublished": 2021,
      "dateRead": "2022-07-16",
      "review": "Disturbing but intriguing. Am I the only one who doesn't understand how she had two pregnancies/births in such quick succession??"
    },
    {
      "id": "44",
      "title": "Chemistry",
      "author": "Weike Wang",
      "myRating": 4,
      "averageRating": 3.74,
      "yearPublished": 2017,
      "dateRead": "2022-07-14",
      "review": "Delightful yet poignant."
    },
    {
      "id": "92",
      "title": "Other People's Clothes",
      "author": "Calla Henkel",
      "myRating": 5,
      "averageRating": 3.69,
      "yearPublished": 2022,
      "dateRead": "2022-07-12",
      "review": "What a thrill!!! Couldn't put it down."
    },
    {
      "id": "141",
      "title": "Happy for You",
      "author": "Claire Stanford",
      "myRating": 5,
      "averageRating": 3.3,
      "yearPublished": 2022,
      "dateRead": "2022-07-11",
      "review": "I loved this book. I rarely laugh out loud at books. This one also made me cry. So much to think about. Happiness is not something to be commodified and commercialized. Loved the quote about social media. \"This is the reason that Montaigne argues for a separation between public and private spheres-the subjective nature of happiness demands it. We each need space to try to achieve happiness privately, without interference from the public. Montaigne would be horrified, for example, at the proliferation of social media, where we take what should, in his view, be private and make it public. Not only is it obscene, it doesn't serve us. We obscure our own happiness from ourselves by trying to project it and articulate it and prove it to others. These sites, he would say, flatten and falsify happiness when they ask us to affirm each other's life choices through likes.\""
    },
    {
      "id": "86",
      "title": "No One Tells You This",
      "author": "Glynnis MacNicol",
      "myRating": 4,
      "averageRating": 3.91,
      "yearPublished": 2018,
      "dateRead": "2022-07-04",
      "review": "I actually really enjoyed this memoir even though at first I wasn't expecting to. I get mad when women obsess over the idea of marriage and babies. I was frustrated when a similar memoir \"what I was doing while you were breeding\" ended with her getting married and having a baby after she bashed the idea relentlessly. But I have realized that it's not the fault of the women who write these memoirs, it's the tropes of society and how we force women into thinking success = marriage + baby. Do I know what trope means? At first I was annoyed when she wanted a gold star for paying her own bills and buying her own groceries - like yeah that's not a feminist achievement. But I do see how it would be draining to not have an emergency contact to rely on. I just hate how single women are pitied but no one bats an eye at single men. She discussed the plight of her mother quite delicately. It was devastating to see the way Parkinson's robs people of not dying alone. Made me sad when she said something to the effect of the only women to look up to were Laura ingles wilder and Carrie Bradshaw..? To me, Carrie Bradshaw embodies every toxic female stereotype ever. I deeply loathe her. \"As I continued to worry over what sort of future I was setting myself up for, she seemed a painful cautionary tale that life was not a savings plan, accrued now for enjoyment later. I was alive now. My responsibility was to live now as fully as possible.\""
    },
    {
      "id": "142",
      "title": "The People We Keep",
      "author": "Allison Larkin",
      "myRating": 2,
      "averageRating": 4.09,
      "yearPublished": 2021,
      "dateRead": "2022-06-29",
      "review": "Lots of issues with this book. Felt like reading \"Wild\" by Cheryl Strayed. Everyone wants to have sex with her and help her. She feels alone and like she can't be loved. Blah blah blah."
    },
    {
      "id": "145",
      "title": "Felix Ever After",
      "author": "Kacen Callender",
      "myRating": 5,
      "averageRating": 4.21,
      "yearPublished": 2020,
      "dateRead": "2022-06-27",
      "review": null
    },
    {
      "id": "144",
      "title": "Tell Me How to Be",
      "author": "Neel Patel",
      "myRating": 5,
      "averageRating": 4.15,
      "yearPublished": 2021,
      "dateRead": "2022-06-26",
      "review": "Normally I hate when the narrator switches back and forth but I loved this book and both characters."
    },
    {
      "id": "143",
      "title": "Girl in Pieces",
      "author": "Kathleen Glasgow",
      "myRating": 5,
      "averageRating": 3.93,
      "yearPublished": 2016,
      "dateRead": "2022-06-25",
      "review": "Devoured in a day. Heartbreaking."
    },
    {
      "id": "146",
      "title": "Better Than Before: Mastering the Habits of Our Everyday Lives",
      "author": "Gretchen Rubin",
      "myRating": 3,
      "averageRating": 3.82,
      "yearPublished": 2015,
      "dateRead": "2022-04-23",
      "review": "I listened to this on a flight and definitely nodded off during some of it but I am very into habit formation so I liked it. I'm also the same personality (classic upholder) as Gretchen so I don't find her as jarring as others do."
    },
    {
      "id": "147",
      "title": "Rock Paper Scissors",
      "author": "Alice Feeney",
      "myRating": 3,
      "averageRating": 3.88,
      "yearPublished": 2021,
      "dateRead": "2022-03-31",
      "review": "Meh. Struggled to finish. Found it pretty boring - not thrilling at all. The twist was mildly compelling but not enough to make this book enjoyable."
    },
    {
      "id": "148",
      "title": "Healthy as F*ck: The Habits You Need to Get Lean, Stay Healthy, and Kick Ass at Life",
      "author": "Oonagh Duncan",
      "myRating": 3,
      "averageRating": 4.08,
      "yearPublished": 2019,
      "dateRead": "2022-03-23",
      "review": "I am very much an \"all or nothing\" person so I liked the part about being okay with half assing things instead of beating yourself up about not being perfect. But I didn't love this book as much as all the other reviewers."
    },
    {
      "id": "149",
      "title": "Severance",
      "author": "Ling Ma",
      "myRating": 4,
      "averageRating": 3.88,
      "yearPublished": 2018,
      "dateRead": "2022-03-07",
      "review": "Station 11 meets crying in h mart. I was on the edge of my seat. But then it just...ended. I guess that's fine."
    },
    {
      "id": "150",
      "title": "Me Talk Pretty One Day",
      "author": "David Sedaris",
      "myRating": 4,
      "averageRating": 4.01,
      "yearPublished": 2001,
      "dateRead": "2022-02-07",
      "review": "Loved the first half but the second half was pretty boring."
    },
    {
      "id": "78",
      "title": "Crying in H Mart",
      "author": "Michelle Zauner",
      "myRating": 4,
      "averageRating": 4.23,
      "yearPublished": 2021,
      "dateRead": "2022-01-26",
      "review": "Like others said - it feels wrong to give this book a rating. I feel obligated to give this 4 stars even though I want to give it 3. Devoured the first half. But after her mother's death I felt like the book faltered and it was all about food and I started skimming. I never do that so that was disappointing. My parents moved to Eugene so I liked all the parts about Oregon. Made me think about my difficult relationship with my mother...she is definitely not a \"mommy mom\""
    },
    {
      "id": "151",
      "title": "Inside Out",
      "author": "Demi Moore",
      "myRating": 4,
      "averageRating": 3.94,
      "yearPublished": 2019,
      "dateRead": "2022-01-23",
      "review": "Not really sure why I read this book but I thought it was alright."
    },
    {
      "id": "99",
      "title": "The Happiness Project",
      "author": "Gretchen Rubin",
      "myRating": 3,
      "averageRating": 3.65,
      "yearPublished": 2009,
      "dateRead": "2022-01-18",
      "review": "I get why people say her perspective is a very narrow one filled with privilege but I really like the idea of dedicating each month to an area of your life that you'd like to improve. I love how she didn't do an \"eat, pray, love\" and quit her job and do yoga in Bali - you can focus on happiness in your day to day life."
    },
    {
      "id": "152",
      "title": "Malibu Rising",
      "author": "Taylor Jenkins Reid",
      "myRating": 2,
      "averageRating": 4.02,
      "yearPublished": 2021,
      "dateRead": "2022-01-09",
      "review": "Did not enjoy. Cheesy. Is this her thing - writing about \"celebrity-like\" characters from the past? I liked daisy jones & the six but won't read another one of hers."
    },
    {
      "id": "153",
      "title": "Nonviolent Communication: A Language of Life",
      "author": "Marshall B. Rosenberg",
      "myRating": 5,
      "averageRating": 4.33,
      "yearPublished": 2003,
      "dateRead": "2021-12-26",
      "review": null
    },
    {
      "id": "154",
      "title": "Linchpin: Are You Indispensable?",
      "author": "Seth Godin",
      "myRating": 3,
      "averageRating": 3.83,
      "yearPublished": 2010,
      "dateRead": "2021-12-22",
      "review": null
    },
    {
      "id": "155",
      "title": "Thanks for Waiting: The Joy (& Weirdness) of Being a Late Bloomer",
      "author": "Doree Shafrir",
      "myRating": 3,
      "averageRating": 3.64,
      "yearPublished": 2021,
      "dateRead": "2021-11-04",
      "review": "Almost exactly the same as \"You'll Grow Out Of It\" Liked the first half. The second half was ALL about her IVF journey and it just wasn't that interesting. Then the book just kind of ended."
    },
    {
      "id": "156",
      "title": "Three Women",
      "author": "Lisa Taddeo",
      "myRating": 4,
      "averageRating": 3.71,
      "yearPublished": 2019,
      "dateRead": "2021-10-31",
      "review": "Justice for Maggie. Very triggering. Believe women. There was a teacher at my middle school who was beloved just like this teacher until it was discovered that he had sexual relations with 8th grade girls but he did not get away with it and I believe is now (still?) serving time. But I know that's not how most stories play out. This is not a book about female desire. It's a book about how little the world values women and thus how little women value themselves. Made me very sad. Related to a lot of it."
    },
    {
      "id": "77",
      "title": "Bowing to Light: A Mother's Journey Through Grief",
      "author": "Rachael Maier",
      "myRating": 5,
      "averageRating": 4.71,
      "yearPublished": 2021,
      "dateRead": "2021-10-26",
      "review": "Heartbreakingly beautiful. She writes with the same ethereal lightness that she radiates in person. I read \"The Light Between Us\" by Laura Lynn Jackson just before this. It's all about how we are connected to those that cross - specifically to children we lose. I am now a firm believer that we carry those we have lost with us always. I felt deeply touched by Elora's rainbow signs for her mother. \"Despair means you have reached the bottom, yes, but it also means you will be starting upward next. Where there's a going down, there's always a coming up.\""
    },
    {
      "id": "76",
      "title": "The Light Between Us: Stories from Heaven, Lessons for the Living",
      "author": "Laura Lynne Jackson",
      "myRating": 5,
      "averageRating": 4.38,
      "yearPublished": 2015,
      "dateRead": "2021-10-17",
      "review": "Loved it."
    },
    {
      "id": "157",
      "title": "Make Time: How to Focus on What Matters Every Day",
      "author": "Jake Knapp",
      "myRating": 4,
      "averageRating": 4.07,
      "yearPublished": 2018,
      "dateRead": "2021-10-08",
      "review": "Lots of good tips"
    },
    {
      "id": "158",
      "title": "Yolk",
      "author": "Mary H.K. Choi",
      "myRating": 4,
      "averageRating": 3.94,
      "yearPublished": 2021,
      "dateRead": "2021-09-27",
      "review": null
    },
    {
      "id": "159",
      "title": "A Good Neighborhood",
      "author": "Therese Anne Fowler",
      "myRating": 2,
      "averageRating": 3.81,
      "yearPublished": 2020,
      "dateRead": "2021-09-26",
      "review": "This book is making me depressed when the tree is dying because I've never thought about how cutting down a tree disrupts the natural ecosystem of the area. Wow what a depressing book. It was so slow and I kept waiting for it to get better and it never did. Bad writing."
    },
    {
      "id": "160",
      "title": "Based on a True Story",
      "author": "Delphine de Vigan",
      "myRating": 4,
      "averageRating": 3.95,
      "yearPublished": 2017,
      "dateRead": "2021-09-20",
      "review": "Kind of reminded me of \"sharp objects\" (which I only watched - did not read)"
    },
    {
      "id": "161",
      "title": "Beautiful World, Where Are You",
      "author": "Sally Rooney",
      "myRating": 3,
      "averageRating": 3.53,
      "yearPublished": 2021,
      "dateRead": "2021-09-14",
      "review": "Did not enjoy."
    },
    {
      "id": "162",
      "title": "Uncanny Valley",
      "author": "Anna Wiener",
      "myRating": 4,
      "averageRating": 3.63,
      "yearPublished": 2020,
      "dateRead": "2021-08-24",
      "review": "Really enjoyed the first half (presumably about her time at mixpanel). Felt like the second half (about GitHub) dragged a bit. The ending was depressing. Excellent writing."
    },
    {
      "id": "163",
      "title": "Cutting for Stone",
      "author": "Abraham Verghese",
      "myRating": 4,
      "averageRating": 4.33,
      "yearPublished": 2009,
      "dateRead": "2021-08-11",
      "review": "Tough read. I had to put it down a few times. But I found it pretty engrossing near the end. Sad. Beautiful story telling. Inspiring that this author was just like I am going to Iowa to get my MFA after being a doctor. I am rethinking my career and I like seeing that you can always reinvent yourself. Oh forgot to say I HATE GENET. HATE."
    },
    {
      "id": "104",
      "title": "Marry Him: The Case for Settling for Mr. Good Enough",
      "author": "Lori Gottlieb",
      "myRating": 3,
      "averageRating": 3.61,
      "yearPublished": 2010,
      "dateRead": "2021-07-19",
      "review": "Mixed feelings about this one. I do think it's important to focus on what makes someone a good long term partner instead of solely looking for a \"spark.\" She is so absurdly picky it made me slightly dislike her and I really liked \"maybe you should talk to someone.\" I liked her Ted talk about changing your story. Ultimately instead of focusing on people's flaws you should focus on their positive attributes - this is something I struggle with."
    },
    {
      "id": "105",
      "title": "What I Was Doing While You Were Breeding",
      "author": "Kristin Newman",
      "myRating": 3,
      "averageRating": 3.86,
      "yearPublished": 2014,
      "dateRead": "2021-07-11",
      "review": "Am I the only one that finds it grating that in the end she has a baby via IVF??? With that title??"
    },
    {
      "id": "165",
      "title": "Shrill: Notes from a Loud Woman",
      "author": "Lindy West",
      "myRating": 5,
      "averageRating": 4.16,
      "yearPublished": 2016,
      "dateRead": "2021-06-28",
      "review": "Was not expecting to love this. Made me think about the fat-phobia that I have and made me want to be better. But the best was her story about rape jokes. It really struck me. I wish more men would read this but I know they won't. But she is making the world better. And I'm so sad that she deals with so many trolls every day."
    },
    {
      "id": "164",
      "title": "Transcendent Kingdom",
      "author": "Yaa Gyasi",
      "myRating": 3,
      "averageRating": 4.1,
      "yearPublished": 2020,
      "dateRead": "2021-06-22",
      "review": "Too slow. Couldn't get into it. Decided to finish. Don't get what all the fuss is about. Very boring book. Nothing happens."
    },
    {
      "id": "166",
      "title": "Queenie",
      "author": "Candice Carty-Williams",
      "myRating": 3,
      "averageRating": 3.85,
      "yearPublished": 2019,
      "dateRead": "2021-06-18",
      "review": null
    },
    {
      "id": "167",
      "title": "Yearbook",
      "author": "Seth Rogen",
      "myRating": 4,
      "averageRating": 4.15,
      "yearPublished": 2021,
      "dateRead": "2021-05-30",
      "review": "Amusing"
    },
    {
      "id": "169",
      "title": "I Feel Bad About My Neck and Other Thoughts on Being a Woman",
      "author": "Nora Ephron",
      "myRating": 3,
      "averageRating": 3.74,
      "yearPublished": 2006,
      "dateRead": "2021-04-25",
      "review": "It's a no from me dawg"
    },
    {
      "id": "168",
      "title": "Heartburn",
      "author": "Nora Ephron",
      "myRating": 4,
      "averageRating": 3.62,
      "yearPublished": 1996,
      "dateRead": "2021-04-24",
      "review": "No depth but I had fun for a day."
    },
    {
      "id": "103",
      "title": "Buy Yourself the F*cking Lilies: And Other Rituals to Fix Your Life, from Someone Who's Been There",
      "author": "Tara Schuster",
      "myRating": 4,
      "averageRating": 3.88,
      "yearPublished": 2020,
      "dateRead": "2021-04-19",
      "review": "Now that I've read \"what my bones know,\" I feel like this author probably has a milder version of c-ptsd"
    },
    {
      "id": "170",
      "title": "You Are a Badass: How to Stop Doubting Your Greatness and Start Living an Awesome Life",
      "author": "Jen Sincero",
      "myRating": 4,
      "averageRating": 3.95,
      "yearPublished": 2013,
      "dateRead": "2021-04-06",
      "review": "I guess I'm in the minority but I really liked this book! Lots of good advice."
    },
    {
      "id": "102",
      "title": "From Heartbreak to Wholeness: The Hero's Journey to Joy",
      "author": "Kristine Carlson",
      "myRating": 5,
      "averageRating": 4.03,
      "yearPublished": 2018,
      "dateRead": "2021-04-04",
      "review": null
    },
    {
      "id": "171",
      "title": "Mating in Captivity: Reconciling the Erotic and the Domestic",
      "author": "Esther Perel",
      "myRating": 4,
      "averageRating": 4.17,
      "yearPublished": 2006,
      "dateRead": "2021-03-12",
      "review": null
    },
    {
      "id": "93",
      "title": "Fleishman Is in Trouble",
      "author": "Taffy Brodesser-Akner",
      "myRating": 5,
      "averageRating": 3.65,
      "yearPublished": 2019,
      "dateRead": "2021-03-05",
      "review": "Loved it. Made me sad."
    },
    {
      "id": "172",
      "title": "Breath: The New Science of a Lost Art",
      "author": "James Nestor",
      "myRating": 3,
      "averageRating": 4.14,
      "yearPublished": 2020,
      "dateRead": "2021-02-17",
      "review": null
    },
    {
      "id": "173",
      "title": "Sober Curious: The Blissful Sleep, Greater Focus, Limitless Presence, and Deep Connection Awaiting Us All on the Other Side of Alcohol",
      "author": "Ruby Warrington",
      "myRating": 4,
      "averageRating": 3.6,
      "yearPublished": 2018,
      "dateRead": "2021-02-01",
      "review": null
    },
    {
      "id": "101",
      "title": "Quit Like a Woman: The Radical Choice to Not Drink in a Culture Obsessed with Alcohol",
      "author": "Holly Whitaker",
      "myRating": 4,
      "averageRating": 3.98,
      "yearPublished": 2019,
      "dateRead": "2021-01-28",
      "review": "Picked this book because Chrissy teigen said it inspired her. The first part was super thought provoking. I truly do agree that one day we will look back at alcohol the way we look at smoking and say \"we didn't know any better.\" I really enjoyed the focus on self esteem and liking yourself instead of depriving yourself."
    },
    {
      "id": "174",
      "title": "Behold the Dreamers",
      "author": "Imbolo Mbue",
      "myRating": 4,
      "averageRating": 3.94,
      "yearPublished": 2016,
      "dateRead": "2021-01-25",
      "review": "Did not think it would end the way it did but I guess that's a good thing."
    },
    {
      "id": "100",
      "title": "Dear Girls: Intimate Tales, Untold Secrets, & Advice for Living Your Best Life",
      "author": "Ali Wong",
      "myRating": 4,
      "averageRating": 3.84,
      "yearPublished": 2019,
      "dateRead": "2021-01-06",
      "review": "Such a riot."
    },
    {
      "id": "72",
      "title": "Option B: Facing Adversity, Building Resilience, and Finding Joy",
      "author": "Sheryl Sandberg",
      "myRating": 4,
      "averageRating": 3.84,
      "yearPublished": 2017,
      "dateRead": "2021-01-04",
      "review": null
    },
    {
      "id": "175",
      "title": "Commonwealth",
      "author": "Ann Patchett",
      "myRating": 3,
      "averageRating": 3.83,
      "yearPublished": 2016,
      "dateRead": "2021-01-03",
      "review": "Meh. Hard to keep track of all the characters given all the children and all the divorces..."
    },
    {
      "id": "176",
      "title": "The Stationery Shop",
      "author": "Marjan Kamali",
      "myRating": 2,
      "averageRating": 4.23,
      "yearPublished": 2019,
      "dateRead": "2021-01-01",
      "review": "Long. Boring. Do not get what the fuss is about."
    },
    {
      "id": "177",
      "title": "The Vanishing Half",
      "author": "Brit Bennett",
      "myRating": 3,
      "averageRating": 4.12,
      "yearPublished": 2020,
      "dateRead": "2020-12-29",
      "review": "Depressing."
    },
    {
      "id": "178",
      "title": "Anxious People",
      "author": "Fredrik Backman",
      "myRating": 1,
      "averageRating": 4.17,
      "yearPublished": 2019,
      "dateRead": "2020-12-26",
      "review": "What a deplorable book. I detested every bit of it. The story was preposterous. Seemingly written by a dim witted middle schooler. I hated every character. Couldn't wait for it to end. What on earth are these glowing reviews about? Did we read the same book?"
    },
    {
      "id": "179",
      "title": "American Dirt",
      "author": "Jeanine Cummins",
      "myRating": 5,
      "averageRating": 4.36,
      "yearPublished": 2020,
      "dateRead": "2020-12-25",
      "review": "Enthralling"
    },
    {
      "id": "65",
      "title": "Maybe You Should Talk to Someone: A Therapist, Her Therapist, and Our Lives Revealed",
      "author": "Lori Gottlieb",
      "myRating": 5,
      "averageRating": 4.37,
      "yearPublished": 2019,
      "dateRead": "2020-12-16",
      "review": "I want to be a therapist but I am intimidated by the price tag and time commitment that grad school demands. Also, whenever I share this interest with actual therapists, they immediately tell me not to pursue this path. Why? I started re-reading Lori Gottlieb's books, \"Maybe You Should Talk to Someone\" and \"Marry Him: The Case for Settling for Mr. Good Enough\" (we'll save an analysis of that second title for another post) because I remember that she had a very circuitous path to becoming a therapist. She began her career working in television in Los Angeles, then decided to go to medical school at age 28. She glosses over how she went from being a language major in college to Stanford medical school (where she completed her undergrad), but I understand that her career journey is not the focus of her books. At 33, she decides to drop out of med school to focus on journalism. Per Wikipedia, she was born in 1966 and obtained a Masters of Clinical Psychology at Pepperdine University in 2010. This means she was 44 when she finished her masters! This gives me immense hope. Although I reread this book hoping to learn more about her career, I was reminded of how much I love this book and what a great writer she is. Cried throughout the Julie and John stories. I love therapy!!!"
    },
    {
      "id": "180",
      "title": "Home Fire",
      "author": "Kamila Shamsie",
      "myRating": 5,
      "averageRating": 4.02,
      "yearPublished": 2017,
      "dateRead": "2020-12-15",
      "review": "Devastating"
    },
    {
      "id": "181",
      "title": "Ask Again, Yes",
      "author": "Mary Beth Keane",
      "myRating": 4,
      "averageRating": 3.93,
      "yearPublished": 2019,
      "dateRead": "2020-12-07",
      "review": "I was intrigued the whole time."
    },
    {
      "id": "184",
      "title": "The Cost of Living: A Working Autobiography",
      "author": "Deborah Levy",
      "myRating": 2,
      "averageRating": 4.17,
      "yearPublished": 2018,
      "dateRead": "2020-12-01",
      "review": "Very boring. And whiny. I also hated that she kept calling her friend \"the man that cried at the funeral\" - was that supposed to be clever? Why did the NYT think this book was notable in 2018? It was a total slog, even though it was so short."
    },
    {
      "id": "182",
      "title": "The Dutch House",
      "author": "Ann Patchett",
      "myRating": 4,
      "averageRating": 4.1,
      "yearPublished": 2019,
      "dateRead": "2020-11-29",
      "review": "Engrossing."
    },
    {
      "id": "185",
      "title": "Let's Explore Diabetes with Owls: Essays, Etc.",
      "author": "David Sedaris",
      "myRating": 3,
      "averageRating": 3.85,
      "yearPublished": 2013,
      "dateRead": "2020-11-28",
      "review": "Not nearly as good as calypso. I listened to parts of it as an audiobook and they had Andrew bird do interludes between each story which I absolutely DETESTED. And I love Andrew bird. Would not recommend this one."
    },
    {
      "id": "186",
      "title": "Calypso",
      "author": "David Sedaris",
      "myRating": 4,
      "averageRating": 4.1,
      "yearPublished": 2018,
      "dateRead": "2020-11-26",
      "review": "Delightful"
    },
    {
      "id": "187",
      "title": "The Education of an Idealist: A Memoir",
      "author": "Samantha Power",
      "myRating": 3,
      "averageRating": 4.34,
      "yearPublished": 2019,
      "dateRead": "2020-11-15",
      "review": "Loved the beginning about her upbringing but found the bulk of the book seemed to be a collection of stories saying \"look at all the noble things I did.\" Wayyyy wayyyy too long. Couldn't wait to be done. Sad because I wanted to love this book."
    },
    {
      "id": "188",
      "title": "The Lager Queen of Minnesota",
      "author": "J. Ryan Stradal",
      "myRating": 3,
      "averageRating": 4.01,
      "yearPublished": 2019,
      "dateRead": "2020-11-05",
      "review": "In the end it was a little too hokey for me but I enjoyed the characters and it was an easy, quick, fun read."
    },
    {
      "id": "189",
      "title": "Patsy",
      "author": "Nicole Y. Dennis-Benn",
      "myRating": 4,
      "averageRating": 3.91,
      "yearPublished": 2019,
      "dateRead": "2020-11-02",
      "review": null
    },
    {
      "id": "191",
      "title": "A Visit from the Goon Squad",
      "author": "Jennifer Egan",
      "myRating": 3,
      "averageRating": 3.7,
      "yearPublished": 2010,
      "dateRead": "2020-10-19",
      "review": null
    },
    {
      "id": "67",
      "title": "The Artist's Way: A Spiritual Path to Higher Creativity",
      "author": "Julia Cameron",
      "myRating": 5,
      "averageRating": 3.96,
      "yearPublished": 2020,
      "dateRead": "2020-10-18",
      "review": "Changed my life."
    },
    {
      "id": "192",
      "title": "Daisy Jones & The Six",
      "author": "Taylor Jenkins Reid",
      "myRating": 4,
      "averageRating": 4.2,
      "yearPublished": 2019,
      "dateRead": "2020-10-16",
      "review": "I'm embarrassed to admit I didn't know this was fiction. I googled the photo of daisy in the pool and found out this was in fact not a true story and I was sad! at first I thought I would hate the format but it totally worked and I loved it. All the females are so great. So many good quotes. Disappointed that they aren't real but I guess that means the book accomplished something raw and I like that. Fun read. If you need me I'll be listening to rumors."
    },
    {
      "id": "193",
      "title": "Nothing to See Here",
      "author": "Kevin Wilson",
      "myRating": 4,
      "averageRating": 3.96,
      "yearPublished": 2019,
      "dateRead": "2020-10-11",
      "review": null
    },
    {
      "id": "194",
      "title": "Pachinko",
      "author": "Min Jin Lee",
      "myRating": 3,
      "averageRating": 4.34,
      "yearPublished": 2017,
      "dateRead": "2020-10-09",
      "review": null
    },
    {
      "id": "195",
      "title": "The Great Believers",
      "author": "Rebecca Makkai",
      "myRating": 4,
      "averageRating": 4.3,
      "yearPublished": 2018,
      "dateRead": "2020-10-03",
      "review": null
    },
    {
      "id": "199",
      "title": "The Idiot",
      "author": "Elif Batuman",
      "myRating": 2,
      "averageRating": 3.64,
      "yearPublished": 2017,
      "dateRead": "2020-09-28",
      "review": "Started off promising but turned into a slog. Painful to read. Then it just ends and you regret all the hard work you put in to read this dull book."
    },
    {
      "id": "198",
      "title": "Normal People",
      "author": "Sally Rooney",
      "myRating": 2,
      "averageRating": 3.81,
      "yearPublished": 2019,
      "dateRead": "2020-09-27",
      "review": "Wanted to read to see if it was different from the show but it was so boring because the show an exact replica of the book. Nothing new. The show is aesthetically pleasing but the two characters are buffoons. I liked conversations with friends but this book lacks the smart dialog - it's just self absorbed children failing to communicate. Would not recommend. I also hate how spineless Marianne is - cringey."
    },
    {
      "id": "197",
      "title": "Single State of Mind",
      "author": "Andi Dorfman",
      "myRating": 3,
      "averageRating": 3.57,
      "yearPublished": 2018,
      "dateRead": "2020-09-23",
      "review": "Total drivel but I needed to escape for a minute."
    },
    {
      "id": "196",
      "title": "White Fur",
      "author": "Jardine Libaire",
      "myRating": 2,
      "averageRating": 3.3,
      "yearPublished": 2017,
      "dateRead": "2020-09-18",
      "review": null
    },
    {
      "id": "218",
      "title": "Love Warrior",
      "author": "Glennon Doyle Melton",
      "myRating": 2,
      "averageRating": 4.07,
      "yearPublished": 2016,
      "dateRead": "2020-09-14",
      "review": "What a crock of shit. Why do I keep doing this to myself? I felt the same way about untamed. I related to the beginning. But then I realized she refuses to take any accountability for her life. She gets sooo preachy in the second half and it makes me want to throw things. Skip all Glennon Doyle books. Only read brene brown if you want to read about true vulnerability."
    },
    {
      "id": "219",
      "title": "Conversations with Friends",
      "author": "Sally Rooney",
      "myRating": 4,
      "averageRating": 3.73,
      "yearPublished": 2017,
      "dateRead": "2020-09-05",
      "review": "Devoured it in a day. How is she only 29? Love her writing. Agree that characters were unlikeable but that didn't stop me from enjoying the book."
    },
    {
      "id": "249",
      "title": "Untamed",
      "author": "Glennon Doyle",
      "myRating": 3,
      "averageRating": 3.98,
      "yearPublished": 2020,
      "dateRead": "2020-07-23",
      "review": "Could not wait for this book to end! Audiobook was painful. So preachy but I don't aspire to be anything like this woman who claims to be an inspirational speaker. Save your time and listen to someone who is less self involved and self obsessed."
    },
    {
      "id": "183",
      "title": "Saving Capitalism: For the Many, Not the Few",
      "author": "Robert B. Reich",
      "myRating": 4,
      "averageRating": 4.18,
      "yearPublished": 2015,
      "dateRead": "2020-07-15",
      "review": "Love him. He explains the problems well but seems to be short on solutions."
    },
    {
      "id": "261",
      "title": "Catch and Kill: Lies, Spies, and a Conspiracy to Protect Predators",
      "author": "Ronan Farrow",
      "myRating": 4,
      "averageRating": 4.4,
      "yearPublished": 2019,
      "dateRead": "2020-07-02",
      "review": null
    },
    {
      "id": "259",
      "title": "Me and White Supremacy: Combat Racism, Change the World, and Become a Good Ancestor",
      "author": "Layla F. Saad",
      "myRating": 5,
      "averageRating": 4.33,
      "yearPublished": 2020,
      "dateRead": "2020-06-24",
      "review": "So far I have only listened to this book as an audiobook and I have not done the reflective journaling prompts. Uncomfortable stuff came up that I wasn't previously aware of."
    },
    {
      "id": "260",
      "title": "Just Mercy: A Story of Justice and Redemption",
      "author": "Bryan Stevenson",
      "myRating": 5,
      "averageRating": 4.62,
      "yearPublished": 2014,
      "dateRead": "2020-06-24",
      "review": null
    },
    {
      "id": "253",
      "title": "All Adults Here",
      "author": "Emma Straub",
      "myRating": 3,
      "averageRating": 3.57,
      "yearPublished": 2020,
      "dateRead": "2020-06-17",
      "review": null
    },
    {
      "id": "237",
      "title": "The Last Romantics",
      "author": "Tara Conklin",
      "myRating": 3,
      "averageRating": 3.7,
      "yearPublished": 2019,
      "dateRead": "2020-06-08",
      "review": null
    },
    {
      "id": "252",
      "title": "Such a Fun Age",
      "author": "Kiley Reid",
      "myRating": 4,
      "averageRating": 3.77,
      "yearPublished": 2019,
      "dateRead": "2020-06-06",
      "review": null
    },
    {
      "id": "236",
      "title": "The Immortalists",
      "author": "Chloe Benjamin",
      "myRating": 3,
      "averageRating": 3.71,
      "yearPublished": 2018,
      "dateRead": "2020-06-04",
      "review": null
    },
    {
      "id": "238",
      "title": "City of Girls",
      "author": "Elizabeth Gilbert",
      "myRating": 4,
      "averageRating": 4.04,
      "yearPublished": 2019,
      "dateRead": "2020-06-01",
      "review": null
    },
    {
      "id": "247",
      "title": "White Fragility: Why It's So Hard for White People to Talk About Racism",
      "author": "Robin DiAngelo",
      "myRating": 5,
      "averageRating": 4.16,
      "yearPublished": 2018,
      "dateRead": "2020-06-01",
      "review": null
    },
    {
      "id": "248",
      "title": "Know My Name",
      "author": "Chanel Miller",
      "myRating": 5,
      "averageRating": 4.68,
      "yearPublished": 2019,
      "dateRead": "2020-05-28",
      "review": "This book should be required reading by every human who walks this earth. It gutted me and she spoke truth to my soul. It was so beautiful. I can't express how much it touched me."
    },
    {
      "id": "250",
      "title": "Eleanor Oliphant Is Completely Fine",
      "author": "Gail Honeyman",
      "myRating": 3,
      "averageRating": 4.23,
      "yearPublished": 2018,
      "dateRead": "2020-05-25",
      "review": null
    },
    {
      "id": "251",
      "title": "The Editor",
      "author": "Steven Rowley",
      "myRating": 3,
      "averageRating": 3.81,
      "yearPublished": 2019,
      "dateRead": "2020-05-12",
      "review": null
    },
    {
      "id": "255",
      "title": "On Earth We're Briefly Gorgeous",
      "author": "Ocean Vuong",
      "myRating": 2,
      "averageRating": 4.01,
      "yearPublished": 2019,
      "dateRead": "2020-05-12",
      "review": null
    },
    {
      "id": "258",
      "title": "The Gifted School",
      "author": "Bruce Holsinger",
      "myRating": 4,
      "averageRating": 3.71,
      "yearPublished": 2019,
      "dateRead": "2020-05-12",
      "review": null
    },
    {
      "id": "256",
      "title": "Leading Men",
      "author": "Christopher Castellani",
      "myRating": 3,
      "averageRating": 3.51,
      "yearPublished": 2019,
      "dateRead": "2020-05-11",
      "review": null
    },
    {
      "id": "257",
      "title": "Rules for Visiting",
      "author": "Jessica Francis Kane",
      "myRating": 4,
      "averageRating": 3.73,
      "yearPublished": 2019,
      "dateRead": "2020-05-11",
      "review": null
    },
    {
      "id": "254",
      "title": "Brotopia: Breaking Up the Boys' Club of Silicon Valley",
      "author": "Emily Chang",
      "myRating": 3,
      "averageRating": 4,
      "yearPublished": 2018,
      "dateRead": "2020-01-01",
      "review": null
    },
    {
      "id": "266",
      "title": "David and Goliath: Underdogs, Misfits, and the Art of Battling Giants",
      "author": "Malcolm Gladwell",
      "myRating": 5,
      "averageRating": 3.97,
      "yearPublished": 2013,
      "dateRead": "2019-12-01",
      "review": null
    },
    {
      "id": "264",
      "title": "My Year with Eleanor: A Memoir",
      "author": "Noelle Hancock",
      "myRating": 3,
      "averageRating": 3.87,
      "yearPublished": 2011,
      "dateRead": "2019-11-05",
      "review": null
    },
    {
      "id": "245",
      "title": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "myRating": 2,
      "averageRating": 4.37,
      "yearPublished": 2018,
      "dateRead": "2019-09-14",
      "review": "What in the world? Why is this book so popular? It was SO BORING and I kept waiting for a twist that never came. I feel like I'm taking crazy pills why do people enjoy this book?!"
    },
    {
      "id": "246",
      "title": "Outliers: The Story of Success",
      "author": "Malcolm Gladwell",
      "myRating": 4,
      "averageRating": 4.19,
      "yearPublished": 2008,
      "dateRead": "2019-09-13",
      "review": null
    },
    {
      "id": "267",
      "title": "I'll Give You the Sun",
      "author": "Jandy Nelson",
      "myRating": 4,
      "averageRating": 4.15,
      "yearPublished": 2014,
      "dateRead": "2019-09-13",
      "review": null
    },
    {
      "id": "239",
      "title": "Station Eleven",
      "author": "Emily St. John Mandel",
      "myRating": 4,
      "averageRating": 4.07,
      "yearPublished": 2014,
      "dateRead": "2019-09-01",
      "review": null
    },
    {
      "id": "244",
      "title": "Stay with Me",
      "author": "Ayobami Adebayo",
      "myRating": 3,
      "averageRating": 4.06,
      "yearPublished": 2017,
      "dateRead": "2019-08-19",
      "review": null
    },
    {
      "id": "228",
      "title": "An American Marriage",
      "author": "Tayari Jones",
      "myRating": 4,
      "averageRating": 3.93,
      "yearPublished": 2018,
      "dateRead": "2019-07-21",
      "review": null
    },
    {
      "id": "234",
      "title": "Real Happiness at Work: Meditations for Accomplishment, Achievement, and Peace",
      "author": "Sharon Salzberg",
      "myRating": 3,
      "averageRating": 4.03,
      "yearPublished": 2013,
      "dateRead": "2019-07-21",
      "review": null
    },
    {
      "id": "74",
      "title": "The Five Invitations: Discovering What Death Can Teach Us About Living Fully",
      "author": "Frank Ostaseski",
      "myRating": 4,
      "averageRating": 4.45,
      "yearPublished": 2017,
      "dateRead": "2019-07-14",
      "review": null
    },
    {
      "id": "230",
      "title": "Heartland: A Memoir of Working Hard and Being Broke in the Richest Country on Earth",
      "author": "Sarah Smarsh",
      "myRating": 4,
      "averageRating": 3.76,
      "yearPublished": 2018,
      "dateRead": "2019-07-14",
      "review": null
    },
    {
      "id": "233",
      "title": "Educated",
      "author": "Tara Westover",
      "myRating": 5,
      "averageRating": 4.47,
      "yearPublished": 2018,
      "dateRead": "2019-07-14",
      "review": null
    },
    {
      "id": "224",
      "title": "Dare to Lead",
      "author": "Bren√© Brown",
      "myRating": 3,
      "averageRating": 4.18,
      "yearPublished": 2018,
      "dateRead": "2019-07-01",
      "review": null
    },
    {
      "id": "229",
      "title": "Warlight",
      "author": "Michael Ondaatje",
      "myRating": 4,
      "averageRating": 3.6,
      "yearPublished": 2018,
      "dateRead": "2019-07-01",
      "review": null
    },
    {
      "id": "231",
      "title": "Americanah",
      "author": "Chimamanda Ngozi Adichie",
      "myRating": 3,
      "averageRating": 4.31,
      "yearPublished": 2013,
      "dateRead": "2019-05-02",
      "review": null
    },
    {
      "id": "232",
      "title": "A Little Life",
      "author": "Hanya Yanagihara",
      "myRating": 5,
      "averageRating": 4.28,
      "yearPublished": 2015,
      "dateRead": "2019-04-22",
      "review": null
    },
    {
      "id": "225",
      "title": "Becoming",
      "author": "Michelle Obama",
      "myRating": 5,
      "averageRating": 4.44,
      "yearPublished": 2018,
      "dateRead": "2019-04-01",
      "review": null
    },
    {
      "id": "241",
      "title": "The Big Short: Inside the Doomsday Machine",
      "author": "Michael Lewis",
      "myRating": 5,
      "averageRating": 4.3,
      "yearPublished": 2015,
      "dateRead": "2019-04-01",
      "review": null
    },
    {
      "id": "243",
      "title": "Notorious RBG: The Life and Times of Ruth Bader Ginsburg",
      "author": "Irin Carmon",
      "myRating": 3,
      "averageRating": 4.18,
      "yearPublished": 2015,
      "dateRead": "2019-04-01",
      "review": null
    },
    {
      "id": "262",
      "title": "Bad Blood: Secrets and Lies in a Silicon Valley Startup",
      "author": "John Carreyrou",
      "myRating": 4,
      "averageRating": 4.4,
      "yearPublished": 2018,
      "dateRead": "2019-04-01",
      "review": null
    },
    {
      "id": "265",
      "title": "Designing Your Life: How to Build a Well-Lived, Joyful Life",
      "author": "Bill Burnett",
      "myRating": 3,
      "averageRating": 3.9,
      "yearPublished": 2016,
      "dateRead": "2019-03-15",
      "review": null
    },
    {
      "id": "222",
      "title": "Don't Sweat the Small Stuff ... and It's All Small Stuff: Simple Ways to Keep the Little Things From Taking Over Your Life",
      "author": "Richard Carlson",
      "myRating": 4,
      "averageRating": 4,
      "yearPublished": 1997,
      "dateRead": "2019-03-01",
      "review": null
    },
    {
      "id": "226",
      "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
      "author": "James Clear",
      "myRating": 3,
      "averageRating": 4.32,
      "yearPublished": 2018,
      "dateRead": "2019-03-01",
      "review": null
    },
    {
      "id": "220",
      "title": "A Return to Love: Reflections on the Principles of \"A Course in Miracles\"",
      "author": "Marianne Williamson",
      "myRating": 3,
      "averageRating": 4.25,
      "yearPublished": 1996,
      "dateRead": "2019-02-01",
      "review": null
    },
    {
      "id": "227",
      "title": "Ikigai: The Japanese Secret to a Long and Happy Life / The Little Book of Hygge / Lagom: The Swedish Art of Balanced Living",
      "author": "H√©ctor Garc√≠a",
      "myRating": 3,
      "averageRating": 3.85,
      "yearPublished": 2018,
      "dateRead": "2019-02-01",
      "review": null
    },
    {
      "id": "242",
      "title": "Running with the Mind of Meditation: Lessons for Training Body and Mind",
      "author": "Sakyong Mipham",
      "myRating": 3,
      "averageRating": 3.85,
      "yearPublished": 2012,
      "dateRead": "2019-02-01",
      "review": null
    },
    {
      "id": "235",
      "title": "The Last Girl: My Story of Captivity, and My Fight Against the Islamic State",
      "author": "Nadia Murad",
      "myRating": 5,
      "averageRating": 4.48,
      "yearPublished": 2017,
      "dateRead": "2019-01-23",
      "review": null
    },
    {
      "id": "221",
      "title": "The Reader",
      "author": "Bernhard Schlink",
      "myRating": 3,
      "averageRating": 3.79,
      "yearPublished": 1997,
      "dateRead": "2019-01-01",
      "review": null
    },
    {
      "id": "223",
      "title": "The Dream Daughter",
      "author": "Diane Chamberlain",
      "myRating": 3,
      "averageRating": 4.26,
      "yearPublished": 2018,
      "dateRead": "2019-01-01",
      "review": null
    },
    {
      "id": "240",
      "title": "Self-Compassion: The Proven Power of Being Kind to Yourself",
      "author": "Kristin Neff",
      "myRating": 3,
      "averageRating": 4.13,
      "yearPublished": 2011,
      "dateRead": "2019-01-01",
      "review": null
    },
    {
      "id": "263",
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "myRating": 4,
      "averageRating": 3.92,
      "yearPublished": 1993,
      "dateRead": "2019-01-01",
      "review": null
    },
    {
      "id": "217",
      "title": "Lost Connections: Uncovering the Real Causes of Depression - and the Unexpected Solutions",
      "author": "Johann Hari",
      "myRating": 5,
      "averageRating": 4.26,
      "yearPublished": 2018,
      "dateRead": "2018-12-21",
      "review": null
    },
    {
      "id": "207",
      "title": "Under the Udala Trees",
      "author": "Chinelo Okparanta",
      "myRating": 5,
      "averageRating": 4.03,
      "yearPublished": 2015,
      "dateRead": "2018-12-03",
      "review": null
    },
    {
      "id": "98",
      "title": "You'll Grow Out of It",
      "author": "Jessi Klein",
      "myRating": 4,
      "averageRating": 3.79,
      "yearPublished": 2016,
      "dateRead": "2018-11-13",
      "review": "Read this again because I am in a book rut and I remember laughing aloud when I read this in 2018. It was fun to read again. Made me scared about fertility but I have always been scared about fertility."
    },
    {
      "id": "208",
      "title": "The Bullet Journal Method: Track Your Past, Order Your Present, Plan Your Future",
      "author": "Ryder Carroll",
      "myRating": 5,
      "averageRating": 4.06,
      "yearPublished": 2018,
      "dateRead": "2018-11-01",
      "review": null
    },
    {
      "id": "209",
      "title": "Flash Boys: A Wall Street Revolt",
      "author": "Michael Lewis",
      "myRating": 5,
      "averageRating": 4.14,
      "yearPublished": 2015,
      "dateRead": "2018-11-01",
      "review": null
    },
    {
      "id": "210",
      "title": "What We Lose",
      "author": "Zinzi Clemmons",
      "myRating": 3,
      "averageRating": 3.59,
      "yearPublished": 2017,
      "dateRead": "2018-07-04",
      "review": null
    },
    {
      "id": "201",
      "title": "Hillbilly Elegy: A Memoir of a Family and Culture in Crisis",
      "author": "J.D. Vance",
      "myRating": 5,
      "averageRating": 3.84,
      "yearPublished": 2017,
      "dateRead": "2018-01-26",
      "review": null
    },
    {
      "id": "202",
      "title": "All My Puny Sorrows",
      "author": "Miriam Toews",
      "myRating": 5,
      "averageRating": 4.01,
      "yearPublished": 2014,
      "dateRead": "2017-10-15",
      "review": null
    },
    {
      "id": "203",
      "title": "The Misadventures of Awkward Black Girl",
      "author": "Issa Rae",
      "myRating": 2,
      "averageRating": 3.77,
      "yearPublished": 2015,
      "dateRead": "2017-09-11",
      "review": null
    },
    {
      "id": "204",
      "title": "1Q84 (1Q84, #1-3)",
      "author": "Haruki Murakami",
      "myRating": 1,
      "averageRating": 3.95,
      "yearPublished": 2011,
      "dateRead": "2017-07-30",
      "review": "AWFUL. this book is so long. terrible."
    },
    {
      "id": "205",
      "title": "After the Parade",
      "author": "Lori Ostlund",
      "myRating": 5,
      "averageRating": 3.9,
      "yearPublished": 2015,
      "dateRead": "2017-06-01",
      "review": null
    },
    {
      "id": "273",
      "title": "Fates and Furies",
      "author": "Lauren Groff",
      "myRating": 4,
      "averageRating": 3.59,
      "yearPublished": 2015,
      "dateRead": "2016-11-20",
      "review": null
    },
    {
      "id": "274",
      "title": "The Glass Castle",
      "author": "Jeannette Walls",
      "myRating": 4,
      "averageRating": 4.33,
      "yearPublished": 2006,
      "dateRead": "2015-02-25",
      "review": null
    },
    {
      "id": "276",
      "title": "Dharma Punx: A Memoir",
      "author": "Noah Levine",
      "myRating": 3,
      "averageRating": 3.79,
      "yearPublished": 2004,
      "dateRead": "2014-11-27",
      "review": null
    },
    {
      "id": "70",
      "title": "Wild: From Lost to Found on the Pacific Crest Trail",
      "author": "Cheryl Strayed",
      "myRating": 2,
      "averageRating": 4.07,
      "yearPublished": 2012,
      "dateRead": "2014-09-01",
      "review": "Loved it the first time in 2014. Did not like it the second time in 2021 as soon as she tortured the poor horse. Then I discovered this blog (\"I hate Cheryl Strayed\") and realized that Cheryl Strayed is pretty insufferable."
    },
    {
      "id": "287",
      "title": "Zeitoun",
      "author": "Dave Eggers",
      "myRating": 4,
      "averageRating": 4.05,
      "yearPublished": 2009,
      "dateRead": "2014-07-01",
      "review": null
    },
    {
      "id": "211",
      "title": "10% Happier",
      "author": "Dan Harris",
      "myRating": 3,
      "averageRating": 3.91,
      "yearPublished": 2014,
      "dateRead": null,
      "review": null
    },
    {
      "id": "277",
      "title": "A Million Little Pieces",
      "author": "James Frey",
      "myRating": 3,
      "averageRating": 3.69,
      "yearPublished": 2005,
      "dateRead": null,
      "review": null
    },
    {
      "id": "282",
      "title": "A New Earth: Awakening to Your Life's Purpose",
      "author": "Eckhart Tolle",
      "myRating": 4,
      "averageRating": 4.17,
      "yearPublished": 2006,
      "dateRead": null,
      "review": null
    },
    {
      "id": "278",
      "title": "A Piece of Cake",
      "author": "Cupcake Brown",
      "myRating": 4,
      "averageRating": 4.25,
      "yearPublished": 2007,
      "dateRead": null,
      "review": null
    },
    {
      "id": "73",
      "title": "An Hour to Live, an Hour to Love: The True Story of the Best Gift Ever Given",
      "author": "Richard Carlson",
      "myRating": 5,
      "averageRating": 3.97,
      "yearPublished": 2007,
      "dateRead": null,
      "review": null
    },
    {
      "id": "96",
      "title": "Bossypants",
      "author": "Tina Fey",
      "myRating": 4,
      "averageRating": 3.96,
      "yearPublished": 2011,
      "dateRead": null,
      "review": null
    },
    {
      "id": "212",
      "title": "Everything I Never Told You",
      "author": "Celeste Ng",
      "myRating": 2,
      "averageRating": 3.83,
      "yearPublished": 2014,
      "dateRead": null,
      "review": "Everyone in this story was too self absorbed. No one had a backbone. Couldn't wait for it to be over. Why do people like this book?"
    },
    {
      "id": "200",
      "title": "Father of the Rain",
      "author": "Lily King",
      "myRating": 4,
      "averageRating": 4.04,
      "yearPublished": 2010,
      "dateRead": null,
      "review": null
    },
    {
      "id": "269",
      "title": "Florida",
      "author": "Lauren Groff",
      "myRating": 2,
      "averageRating": 3.77,
      "yearPublished": 2019,
      "dateRead": null,
      "review": "I hate short stories I should have realized I wouldn't like this."
    },
    {
      "id": "279",
      "title": "Flowers for Algernon",
      "author": "Daniel Keyes",
      "myRating": 4,
      "averageRating": 4.24,
      "yearPublished": 2004,
      "dateRead": null,
      "review": null
    },
    {
      "id": "284",
      "title": "For Whom the Bell Tolls",
      "author": "Ernest Hemingway",
      "myRating": 4,
      "averageRating": 3.99,
      "yearPublished": 1995,
      "dateRead": null,
      "review": null
    },
    {
      "id": "216",
      "title": "Girl Wash your Face",
      "author": "Rachel Hollis",
      "myRating": 3,
      "averageRating": 3.57,
      "yearPublished": 2018,
      "dateRead": null,
      "review": null
    },
    {
      "id": "214",
      "title": "Homegoing",
      "author": "Yaa Gyasi",
      "myRating": 4,
      "averageRating": 4.47,
      "yearPublished": 2016,
      "dateRead": null,
      "review": null
    },
    {
      "id": "289",
      "title": "Into the Wild",
      "author": "Jon Krakauer",
      "myRating": 4,
      "averageRating": 4.02,
      "yearPublished": 1997,
      "dateRead": null,
      "review": null
    },
    {
      "id": "288",
      "title": "Into Thin Air: A Personal Account of the Mt. Everest Disaster",
      "author": "Jon Krakauer",
      "myRating": 4,
      "averageRating": 4.26,
      "yearPublished": 1999,
      "dateRead": null,
      "review": null
    },
    {
      "id": "97",
      "title": "Is Everyone Hanging Out Without Me? (And Other Concerns)",
      "author": "Mindy Kaling",
      "myRating": 3,
      "averageRating": 3.86,
      "yearPublished": 2011,
      "dateRead": null,
      "review": null
    },
    {
      "id": "71",
      "title": "Lean In: Women, Work, and the Will to Lead",
      "author": "Sheryl Sandberg",
      "myRating": 3,
      "averageRating": 3.95,
      "yearPublished": 2013,
      "dateRead": null,
      "review": null
    },
    {
      "id": "281",
      "title": "Mother of Pearl",
      "author": "Melinda Haynes",
      "myRating": 4,
      "averageRating": 3.7,
      "yearPublished": 2000,
      "dateRead": null,
      "review": null
    },
    {
      "id": "280",
      "title": "Scar Tissue",
      "author": "Anthony Kiedis",
      "myRating": 4,
      "averageRating": 4.1,
      "yearPublished": 2005,
      "dateRead": null,
      "review": null
    },
    {
      "id": "286",
      "title": "Smashed: Story of a Drunken Girlhood",
      "author": "Koren Zailckas",
      "myRating": 4,
      "averageRating": 3.53,
      "yearPublished": 2006,
      "dateRead": null,
      "review": null
    },
    {
      "id": "270",
      "title": "Swing Time",
      "author": "Zadie Smith",
      "myRating": 1,
      "averageRating": 3.56,
      "yearPublished": 2016,
      "dateRead": null,
      "review": "this book blows. why on earth is this author popular. her real name is sadie. ZADIE U BORE ME."
    },
    {
      "id": "190",
      "title": "The Alice Network",
      "author": "Kate Quinn",
      "myRating": 2,
      "averageRating": 4.32,
      "yearPublished": 2017,
      "dateRead": null,
      "review": "Tried so hard to finish but it's just so bad. Need to stop reading books that Reese Witherspoon likes...I also hate when books switch back and forth between time periods/perspectives."
    },
    {
      "id": "290",
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "myRating": 4,
      "averageRating": 3.8,
      "yearPublished": 2001,
      "dateRead": null,
      "review": null
    },
    {
      "id": "285",
      "title": "The Diary of a Young Girl",
      "author": "Anne Frank",
      "myRating": 4,
      "averageRating": 4.2,
      "yearPublished": 1993,
      "dateRead": null,
      "review": null
    },
    {
      "id": "215",
      "title": "The Female Persuasion",
      "author": "Meg Wolitzer",
      "myRating": 4,
      "averageRating": 3.56,
      "yearPublished": 2018,
      "dateRead": null,
      "review": null
    },
    {
      "id": "291",
      "title": "The Girl With the Dragon Tattoo (Millennium, #1)",
      "author": "Stieg Larsson",
      "myRating": 3,
      "averageRating": 4.18,
      "yearPublished": 2008,
      "dateRead": null,
      "review": null
    },
    {
      "id": "206",
      "title": "The Girls",
      "author": "Emma Cline",
      "myRating": 4,
      "averageRating": 3.51,
      "yearPublished": 2016,
      "dateRead": null,
      "review": null
    },
    {
      "id": "271",
      "title": "The Map of Salt and Stars",
      "author": "Zeyn Joukhadar",
      "myRating": 1,
      "averageRating": 3.91,
      "yearPublished": 2018,
      "dateRead": null,
      "review": "so painfully boring and bad. tried so hard to finish but couldn't."
    },
    {
      "id": "272",
      "title": "The Mothers",
      "author": "Brit Bennett",
      "myRating": 4,
      "averageRating": 3.88,
      "yearPublished": 2016,
      "dateRead": null,
      "review": null
    },
    {
      "id": "213",
      "title": "The Nest",
      "author": "Cynthia D'Aprix Sweeney",
      "myRating": 5,
      "averageRating": 3.41,
      "yearPublished": 2016,
      "dateRead": null,
      "review": null
    },
    {
      "id": "268",
      "title": "The Power of Now: A Guide to Spiritual Enlightenment",
      "author": "Eckhart Tolle",
      "myRating": 5,
      "averageRating": 4.15,
      "yearPublished": 2004,
      "dateRead": null,
      "review": null
    },
    {
      "id": "94",
      "title": "The Sellout",
      "author": "Paul Beatty",
      "myRating": 5,
      "averageRating": 3.75,
      "yearPublished": 2015,
      "dateRead": null,
      "review": null
    },
    {
      "id": "283",
      "title": "The Sun Also Rises",
      "author": "Ernest Hemingway",
      "myRating": 3,
      "averageRating": 3.79,
      "yearPublished": 1957,
      "dateRead": null,
      "review": null
    },
    {
      "id": "75",
      "title": "When Breath Becomes Air",
      "author": "Paul Kalanithi",
      "myRating": 5,
      "averageRating": 4.41,
      "yearPublished": 2016,
      "dateRead": null,
      "review": null
    },
    {
      "id": "275",
      "title": "White Oleander",
      "author": "Janet Fitch",
      "myRating": 3,
      "averageRating": 4,
      "yearPublished": 2001,
      "dateRead": null,
      "review": null
    }
  ],
  "lastUpdated": "2026-01-13"
}